[Killed] BlockStatement
src/logger/SanitizeMessage.ts:8:54
  * @returns {string} The sanitized message. Sensible parts will
  * be overwritten with the text REMOVED BY SANITIZER
  */
-function sanitizeMessage(logMessage: string): string {
-    if (
-        logMessage.includes('got invalid value') &&
-        logMessage.includes('; Field')
-    ) {
-        return (
-            logMessage.slice(0, logMessage.indexOf('got invalid value') + 18) +
-            'REMOVED BY SANITIZER' +
-            logMessage.slice(logMessage.indexOf('; Field'))
-        )
-    }
-    return logMessage
-}
+function sanitizeMessage(logMessage: string): string {}
 
 export { sanitizeMessage }
killedBy: expects a correct logEntry is created for given 'A info message' , 'INFO' and undefined
statusReason: expected undefined to be 'A info message' // Object.is equality

[Killed] ConditionalExpression
src/logger/SanitizeMessage.ts:10:9
  */
 function sanitizeMessage(logMessage: string): string {
     if (
-        logMessage.includes('got invalid value') &&
-        logMessage.includes('; Field')
+        false
     ) {
         return (
killedBy: expects a correct logEntry is created for given 'Variable \"$login\" got invalid value…' , 'INFO' and undefined
statusReason: expected 'Variable \"$login\" got invalid value…' to be 'Variable \"$login\" got invalid value…' // Object.is equality

[Killed] ConditionalExpression
src/logger/SanitizeMessage.ts:10:9
  */
 function sanitizeMessage(logMessage: string): string {
     if (
-        logMessage.includes('got invalid value') &&
-        logMessage.includes('; Field')
+        true
     ) {
         return (
killedBy: expects a correct logEntry is created for given 'A info message' , 'INFO' and undefined
statusReason: expected 'A info messageREMOVED BY SANITIZERe' to be 'A info message' // Object.is equality

[Killed] StringLiteral
src/logger/SanitizeMessage.ts:11:29
 function sanitizeMessage(logMessage: string): string {
     if (
         logMessage.includes('got invalid value') &&
-        logMessage.includes('; Field')
+        logMessage.includes("")
     ) {
         return (
killedBy: expects a correct logEntry is created for given 'Variable \"$login\" got invalid value…' , 'INFO' and undefined
statusReason: expected 'Variable \"$login\" got invalid value…' to be 'Variable \"$login\" got invalid value…' // Object.is equality

[Killed] BlockStatement
src/logger/SanitizeMessage.ts:12:7
     if (
         logMessage.includes('got invalid value') &&
         logMessage.includes('; Field')
-    ) {
-        return (
-            logMessage.slice(0, logMessage.indexOf('got invalid value') + 18) +
-            'REMOVED BY SANITIZER' +
-            logMessage.slice(logMessage.indexOf('; Field'))
-        )
-    }
+    ) {}
     return logMessage
 }
killedBy: expects a correct logEntry is created for given 'Variable \"$login\" got invalid value…' , 'INFO' and undefined
statusReason: expected 'Variable \"$login\" got invalid value…' to be 'Variable \"$login\" got invalid value…' // Object.is equality

[Killed] ArithmeticOperator
src/logger/SanitizeMessage.ts:14:33
         logMessage.includes('; Field')
     ) {
         return (
-            logMessage.slice(0, logMessage.indexOf('got invalid value') + 18) +
+            logMessage.slice(0, logMessage.indexOf('got invalid value') - 18) +
             'REMOVED BY SANITIZER' +
             logMessage.slice(logMessage.indexOf('; Field'))
killedBy: expects a correct logEntry is created for given 'Variable \"$login\" got invalid value…' , 'INFO' and undefined
statusReason: expected 'VaREMOVED BY SANITIZER; Field \"abc\"…' to be 'Variable \"$login\" got invalid value…' // Object.is equality

[Killed] MethodExpression
src/logger/SanitizeMessage.ts:14:13
         logMessage.includes('; Field')
     ) {
         return (
-            logMessage.slice(0, logMessage.indexOf('got invalid value') + 18) +
+            logMessage +
             'REMOVED BY SANITIZER' +
             logMessage.slice(logMessage.indexOf('; Field'))
killedBy: expects a correct logEntry is created for given 'Variable \"$login\" got invalid value…' , 'INFO' and undefined
statusReason: expected 'Variable \"$login\" got invalid value…' to be 'Variable \"$login\" got invalid value…' // Object.is equality

[Killed] MethodExpression
src/logger/SanitizeMessage.ts:16:13
         return (
             logMessage.slice(0, logMessage.indexOf('got invalid value') + 18) +
             'REMOVED BY SANITIZER' +
-            logMessage.slice(logMessage.indexOf('; Field'))
+            logMessage
         )
     }
killedBy: expects a correct logEntry is created for given 'Variable \"$login\" got invalid value…' , 'INFO' and undefined
statusReason: expected 'Variable \"$login\" got invalid value…' to be 'Variable \"$login\" got invalid value…' // Object.is equality
