[Killed] BlockStatement
src/error/DetermineGraphQLOrFetchError.ts:9:70
  * @param {unknown} error - An error
  * @returns {string} FETCH_ERROR if error is a FetchError, GraphQLError otherwise
  */
-export function determineGraphQLOrFetchError(error: unknown): string {
-    return error instanceof Error &&
-        error.message &&
-        (error.message.includes(FETCH_ERROR) ||
-            error.message.includes('fetch failed') ||
-            error.message.includes('ECONNREFUSED') ||
-            error.message.includes('ECONNRESET') ||
-            error.message.includes('EPERM') ||
-            error.message.includes('ETIMEDOUT') ||
-            error.message.includes('network timeout') ||
-            error.message.includes('invalid redirect URL') ||
-            error.message.includes(
-                'uri requested responds with a redirect, redirect mode is set to error',
-            ) ||
-            error.message.includes('maximum redirect reached') ||
-            error.message.includes('Cannot follow redirect') ||
-            error.message.includes('socket hang up'))
-        ? FETCH_ERROR
-        : GRAPHQL_ERROR
-}
+export function determineGraphQLOrFetchError(error: unknown): string {}
 
killedBy: Should get custom fetch error message in response when using GraphQLRequestInfo
statusReason: expected 'Request failed ETIMEDOUT connection f…' to be 'network.error' // Object.is equality

[Killed] LogicalOperator
src/error/DetermineGraphQLOrFetchError.ts:10:12
  * @returns {string} FETCH_ERROR if error is a FetchError, GraphQLError otherwise
  */
 export function determineGraphQLOrFetchError(error: unknown): string {
-    return error instanceof Error &&
-        error.message &&
+    return error instanceof Error || error.message &&
         (error.message.includes(FETCH_ERROR) ||
             error.message.includes('fetch failed') ||
killedBy: Test that increaseFetchOrGraphQLErrorMetric does not throw an error logs a debug message if a logger is defined
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] ConditionalExpression
src/error/DetermineGraphQLOrFetchError.ts:10:12
  * @returns {string} FETCH_ERROR if error is a FetchError, GraphQLError otherwise
  */
 export function determineGraphQLOrFetchError(error: unknown): string {
-    return error instanceof Error &&
-        error.message &&
-        (error.message.includes(FETCH_ERROR) ||
-            error.message.includes('fetch failed') ||
-            error.message.includes('ECONNREFUSED') ||
-            error.message.includes('ECONNRESET') ||
-            error.message.includes('EPERM') ||
-            error.message.includes('ETIMEDOUT') ||
-            error.message.includes('network timeout') ||
-            error.message.includes('invalid redirect URL') ||
-            error.message.includes(
-                'uri requested responds with a redirect, redirect mode is set to error',
-            ) ||
-            error.message.includes('maximum redirect reached') ||
-            error.message.includes('Cannot follow redirect') ||
-            error.message.includes('socket hang up'))
+    return false
         ? FETCH_ERROR
         : GRAPHQL_ERROR
killedBy: Should get custom fetch error message in response when using GraphQLRequestInfo
statusReason: expected 'Request failed ETIMEDOUT connection f…' to be 'network.error' // Object.is equality

[Killed] LogicalOperator
src/error/DetermineGraphQLOrFetchError.ts:12:10
 export function determineGraphQLOrFetchError(error: unknown): string {
     return error instanceof Error &&
         error.message &&
-        (error.message.includes(FETCH_ERROR) ||
-            error.message.includes('fetch failed') ||
-            error.message.includes('ECONNREFUSED') ||
+        ((error.message.includes(FETCH_ERROR) || error.message.includes('fetch failed')) && error.message.includes('ECONNREFUSED') ||
             error.message.includes('ECONNRESET') ||
             error.message.includes('EPERM') ||
killedBy: Should get correct metrics for SimpleMetricsClient
statusReason: expected '\n            # HELP graphql_server_r…' to contain 'graphql_server_errors{errorClass="Gra…'

[Killed] LogicalOperator
src/error/DetermineGraphQLOrFetchError.ts:12:10
 export function determineGraphQLOrFetchError(error: unknown): string {
     return error instanceof Error &&
         error.message &&
-        (error.message.includes(FETCH_ERROR) ||
-            error.message.includes('fetch failed') ||
-            error.message.includes('ECONNREFUSED') ||
-            error.message.includes('ECONNRESET') ||
+        ((error.message.includes(FETCH_ERROR) || error.message.includes('fetch failed') || error.message.includes('ECONNREFUSED')) && error.message.includes('ECONNRESET') ||
             error.message.includes('EPERM') ||
             error.message.includes('ETIMEDOUT') ||
killedBy: Should get correct metrics for SimpleMetricsClient
statusReason: expected '\n            # HELP graphql_server_r…' to contain 'graphql_server_errors{errorClass="Gra…'

[Killed] StringLiteral
src/error/DetermineGraphQLOrFetchError.ts:15:36
         (error.message.includes(FETCH_ERROR) ||
             error.message.includes('fetch failed') ||
             error.message.includes('ECONNREFUSED') ||
-            error.message.includes('ECONNRESET') ||
+            error.message.includes("") ||
             error.message.includes('EPERM') ||
             error.message.includes('ETIMEDOUT') ||
killedBy: Should get correct metrics for SimpleMetricsClient
statusReason: expected '\n            # HELP graphql_server_r…' to contain 'graphql_server_errors{errorClass="Gra…'

[Killed] StringLiteral
src/error/DetermineGraphQLOrFetchError.ts:19:36
             error.message.includes('EPERM') ||
             error.message.includes('ETIMEDOUT') ||
             error.message.includes('network timeout') ||
-            error.message.includes('invalid redirect URL') ||
+            error.message.includes("") ||
             error.message.includes(
                 'uri requested responds with a redirect, redirect mode is set to error',
killedBy: Should get correct metrics for SimpleMetricsClient
statusReason: expected '\n            # HELP graphql_server_r…' to contain 'graphql_server_errors{errorClass="Gra…'

[Killed] StringLiteral
src/error/DetermineGraphQLOrFetchError.ts:24:36
                 'uri requested responds with a redirect, redirect mode is set to error',
             ) ||
             error.message.includes('maximum redirect reached') ||
-            error.message.includes('Cannot follow redirect') ||
+            error.message.includes("") ||
             error.message.includes('socket hang up'))
         ? FETCH_ERROR
killedBy: Should get correct metrics for SimpleMetricsClient
statusReason: expected '\n            # HELP graphql_server_r…' to contain 'graphql_server_errors{errorClass="Gra…'
