[Killed] BlockStatement
src/error/DetermineValidationOrIntrospectionDisabledError.ts:15:11
  */
 export function determineValidationOrIntrospectionDisabledError(
     error: unknown,
-): string {
-    return error instanceof Error &&
-        ((error.message.includes('introspection') &&
-            error.message.includes('disabled')) ||
-            error.message.includes('__Directive'))
-        ? INTROSPECTION_DISABLED_ERROR
-        : VALIDATION_ERROR
-}
+): string {}
 
killedBy: Correctly determine if error Error: GraphQL introspection is disabled is a validation or an introspection error undefined
statusReason: expected undefined to be 'IntrospectionDisabledError' // Object.is equality

[Killed] ConditionalExpression
src/error/DetermineValidationOrIntrospectionDisabledError.ts:16:12
 export function determineValidationOrIntrospectionDisabledError(
     error: unknown,
 ): string {
-    return error instanceof Error &&
-        ((error.message.includes('introspection') &&
-            error.message.includes('disabled')) ||
-            error.message.includes('__Directive'))
+    return false
         ? INTROSPECTION_DISABLED_ERROR
         : VALIDATION_ERROR
killedBy: Correctly determine if error Error: GraphQL introspection is disabled is a validation or an introspection error undefined
statusReason: expected 'ValidationError' to be 'IntrospectionDisabledError' // Object.is equality

[Killed] ConditionalExpression
src/error/DetermineValidationOrIntrospectionDisabledError.ts:16:12
 export function determineValidationOrIntrospectionDisabledError(
     error: unknown,
 ): string {
-    return error instanceof Error &&
-        ((error.message.includes('introspection') &&
-            error.message.includes('disabled')) ||
-            error.message.includes('__Directive'))
+    return true
         ? INTROSPECTION_DISABLED_ERROR
         : VALIDATION_ERROR
killedBy: Correctly determine if error Error: I am a Validation error is a validation or an introspection error undefined
statusReason: expected 'IntrospectionDisabledError' to be 'ValidationError' // Object.is equality

[Killed] LogicalOperator
src/error/DetermineValidationOrIntrospectionDisabledError.ts:17:10
     error: unknown,
 ): string {
     return error instanceof Error &&
-        ((error.message.includes('introspection') &&
-            error.message.includes('disabled')) ||
-            error.message.includes('__Directive'))
+        (error.message.includes('introspection') && error.message.includes('disabled') && error.message.includes('__Directive'))
         ? INTROSPECTION_DISABLED_ERROR
         : VALIDATION_ERROR
killedBy: Correctly determine if error Error: GraphQL introspection is disabled is a validation or an introspection error undefined
statusReason: expected 'ValidationError' to be 'IntrospectionDisabledError' // Object.is equality

[Killed] ConditionalExpression
src/error/DetermineValidationOrIntrospectionDisabledError.ts:17:10
     error: unknown,
 ): string {
     return error instanceof Error &&
-        ((error.message.includes('introspection') &&
-            error.message.includes('disabled')) ||
-            error.message.includes('__Directive'))
+        (true)
         ? INTROSPECTION_DISABLED_ERROR
         : VALIDATION_ERROR
killedBy: Correctly determine if error Error: I am a Validation error is a validation or an introspection error undefined
statusReason: expected 'IntrospectionDisabledError' to be 'ValidationError' // Object.is equality
