[Killed] BlockStatement
src/error/RemoveValidationRecommendationsFromErrors.ts:8:28
 
 function removeValidationRecommendationsFromErrors(
     validationErrors: readonly GraphQLError[],
-): readonly GraphQLError[] {
-    for (const validationError of validationErrors) {
-        if (validationError.message.includes(recommendationText)) {
-            validationError.message = validationError.message.slice(
-                0,
-                Math.max(
-                    0,
-                    validationError.message.indexOf(recommendationText),
-                ),
-            )
-        }
-    }
-    return validationErrors
-}
+): readonly GraphQLError[] {}
 
 export { recommendationText, removeValidationRecommendationsFromErrors }
killedBy: Should get filtered error response if a validation error occurs
statusReason: expected 'GraphQL response should contain at le…' to be 'Cannot query field "userIdABC" on typ…' // Object.is equality

[Killed] BlockStatement
src/error/RemoveValidationRecommendationsFromErrors.ts:9:53
 function removeValidationRecommendationsFromErrors(
     validationErrors: readonly GraphQLError[],
 ): readonly GraphQLError[] {
-    for (const validationError of validationErrors) {
-        if (validationError.message.includes(recommendationText)) {
-            validationError.message = validationError.message.slice(
-                0,
-                Math.max(
-                    0,
-                    validationError.message.indexOf(recommendationText),
-                ),
-            )
-        }
-    }
+    for (const validationError of validationErrors) {}
     return validationErrors
 }
killedBy: Should get filtered error response if a validation error occurs
statusReason: expected 'Cannot query field "userIdABC" on typ…' to be 'Cannot query field "userIdABC" on typ…' // Object.is equality

[Killed] ConditionalExpression
src/error/RemoveValidationRecommendationsFromErrors.ts:10:13
     validationErrors: readonly GraphQLError[],
 ): readonly GraphQLError[] {
     for (const validationError of validationErrors) {
-        if (validationError.message.includes(recommendationText)) {
+        if (true) {
             validationError.message = validationError.message.slice(
                 0,
killedBy: Should get error response if introspection is requested when validation rule NoSchemaIntrospectionCustomRule is set
statusReason: expected '' to be 'GraphQL introspection has been disabl…' // Object.is equality

[Killed] ConditionalExpression
src/error/RemoveValidationRecommendationsFromErrors.ts:10:13
     validationErrors: readonly GraphQLError[],
 ): readonly GraphQLError[] {
     for (const validationError of validationErrors) {
-        if (validationError.message.includes(recommendationText)) {
+        if (false) {
             validationError.message = validationError.message.slice(
                 0,
killedBy: Should get filtered error response if a validation error occurs
statusReason: expected 'Cannot query field "userIdABC" on typ…' to be 'Cannot query field "userIdABC" on typ…' // Object.is equality

[Killed] MethodExpression
src/error/RemoveValidationRecommendationsFromErrors.ts:11:39
 ): readonly GraphQLError[] {
     for (const validationError of validationErrors) {
         if (validationError.message.includes(recommendationText)) {
-            validationError.message = validationError.message.slice(
-                0,
-                Math.max(
-                    0,
-                    validationError.message.indexOf(recommendationText),
-                ),
-            )
+            validationError.message = validationError.message
         }
     }
killedBy: Should get filtered error response if a validation error occurs
statusReason: expected 'Cannot query field "userIdABC" on typ…' to be 'Cannot query field "userIdABC" on typ…' // Object.is equality

[Killed] MethodExpression
src/error/RemoveValidationRecommendationsFromErrors.ts:13:17
         if (validationError.message.includes(recommendationText)) {
             validationError.message = validationError.message.slice(
                 0,
-                Math.max(
-                    0,
-                    validationError.message.indexOf(recommendationText),
-                ),
+                Math.min(0, validationError.message.indexOf(recommendationText)),
             )
         }
killedBy: Should get filtered error response if a validation error occurs
statusReason: expected '' to be 'Cannot query field "userIdABC" on typ…' // Object.is equality
