[Killed] ObjectLiteral
src/logger/CreateLogEntry.ts:18:32
         customErrorName,
     } = logEntryInput
 
-    const logEntry: LogEntry = {
-        level: loglevel ?? 'INFO',
-        logger: loggerName ?? 'fallback-logger',
-        message: sanitizeMessage(logMessage),
-        serviceName: serviceName ?? 'fallback-service',
-        timestamp: createISOTimestamp(dateFunction),
-    }
+    const logEntry: LogEntry = {}
 
     // If there is a serviceName in the context, use it as serviceName for the LogEntry
killedBy: expects a correct logEntry is created for given 'A info message' , 'INFO' and undefined
statusReason: expected undefined to be 'A info message' // Object.is equality

[Killed] LogicalOperator
src/logger/CreateLogEntry.ts:19:16
     } = logEntryInput
 
     const logEntry: LogEntry = {
-        level: loglevel ?? 'INFO',
+        level: loglevel && 'INFO',
         logger: loggerName ?? 'fallback-logger',
         message: sanitizeMessage(logMessage),
killedBy: expects a correct logEntry is created for given 'A debug message' , 'DEBUG' and undefined
statusReason: expected 'INFO' to be 'DEBUG' // Object.is equality

[Killed] LogicalOperator
src/logger/CreateLogEntry.ts:20:17
 
     const logEntry: LogEntry = {
         level: loglevel ?? 'INFO',
-        logger: loggerName ?? 'fallback-logger',
+        logger: loggerName && 'fallback-logger',
         message: sanitizeMessage(logMessage),
         serviceName: serviceName ?? 'fallback-service',
killedBy: Should use fallback values for loggerName, serviceName and level if they are not set
statusReason: expected undefined to be 'fallback-logger' // Object.is equality

[Killed] LogicalOperator
src/logger/CreateLogEntry.ts:22:22
         level: loglevel ?? 'INFO',
         logger: loggerName ?? 'fallback-logger',
         message: sanitizeMessage(logMessage),
-        serviceName: serviceName ?? 'fallback-service',
+        serviceName: serviceName && 'fallback-service',
         timestamp: createISOTimestamp(dateFunction),
     }
killedBy: expects a correct logEntry is created for given 'A info message' , 'INFO' and undefined
statusReason: expected 'fallback-service' to be 'myTestService' // Object.is equality

[Killed] StringLiteral
src/logger/CreateLogEntry.ts:22:37
         level: loglevel ?? 'INFO',
         logger: loggerName ?? 'fallback-logger',
         message: sanitizeMessage(logMessage),
-        serviceName: serviceName ?? 'fallback-service',
+        serviceName: serviceName ?? "",
         timestamp: createISOTimestamp(dateFunction),
     }
killedBy: Should use fallback values for loggerName, serviceName and level if they are not set
statusReason: expected '' to be 'fallback-service' // Object.is equality

[Killed] ConditionalExpression
src/logger/CreateLogEntry.ts:27:9
     }
 
     // If there is a serviceName in the context, use it as serviceName for the LogEntry
-    if (context.serviceName) {
+    if (true) {
         logEntry.serviceName = context.serviceName as string
         if (loglevel === 'ERROR' && context.serviceName !== serviceName) {
killedBy: expects a correct logEntry is created for given 'A info message' , 'INFO' and undefined
statusReason: expected undefined to be 'myTestService' // Object.is equality

[Killed] ConditionalExpression
src/logger/CreateLogEntry.ts:27:9
     }
 
     // If there is a serviceName in the context, use it as serviceName for the LogEntry
-    if (context.serviceName) {
+    if (false) {
         logEntry.serviceName = context.serviceName as string
         if (loglevel === 'ERROR' && context.serviceName !== serviceName) {
killedBy: Should use context.serviceName instead of error.extensions.serviceName if context contains serviceName
statusReason: expected 'myTestService' to be 'myRemoteService' // Object.is equality

[Killed] ConditionalExpression
src/logger/CreateLogEntry.ts:29:13
     // If there is a serviceName in the context, use it as serviceName for the LogEntry
     if (context.serviceName) {
         logEntry.serviceName = context.serviceName as string
-        if (loglevel === 'ERROR' && context.serviceName !== serviceName) {
+        if (true) {
             logEntry.level = 'WARN'
         }
killedBy: Test downgrading loglevel based on service name
statusReason: expected 'WARN' to be 'ERROR' // Object.is equality

[Killed] ConditionalExpression
src/logger/CreateLogEntry.ts:29:13
     // If there is a serviceName in the context, use it as serviceName for the LogEntry
     if (context.serviceName) {
         logEntry.serviceName = context.serviceName as string
-        if (loglevel === 'ERROR' && context.serviceName !== serviceName) {
+        if (true && context.serviceName !== serviceName) {
             logEntry.level = 'WARN'
         }
killedBy: Test downgrading loglevel based on service name
statusReason: expected 'WARN' to be 'INFO' // Object.is equality

[Killed] StringLiteral
src/logger/CreateLogEntry.ts:30:30
     if (context.serviceName) {
         logEntry.serviceName = context.serviceName as string
         if (loglevel === 'ERROR' && context.serviceName !== serviceName) {
-            logEntry.level = 'WARN'
+            logEntry.level = ""
         }
     }
killedBy: Test downgrading loglevel based on service name
statusReason: expected '' to be 'WARN' // Object.is equality

[Killed] BlockStatement
src/logger/CreateLogEntry.ts:33:24
             logEntry.level = 'WARN'
         }
     }
-    if (context.query) {
-        logEntry.query = context.query as string
-    }
+    if (context.query) {}
 
     if (error) {
killedBy: Should get error response when GraphQL context error occurs when calling execute function
statusReason: expected undefined to be 'query users{ users { userId userName …' // Object.is equality

[Killed] ConditionalExpression
src/logger/CreateLogEntry.ts:33:9
             logEntry.level = 'WARN'
         }
     }
-    if (context.query) {
+    if (false) {
         logEntry.query = context.query as string
     }
killedBy: Should get error response when GraphQL context error occurs when calling execute function
statusReason: expected undefined to be 'query users{ users { userId userName …' // Object.is equality

[Killed] LogicalOperator
src/logger/CreateLogEntry.ts:38:30
     }
 
     if (error) {
-        logEntry.errorName = customErrorName ?? error.name
+        logEntry.errorName = customErrorName && error.name
         logEntry.message =
             `${logEntry.message} ${sanitizeMessage(error.message)}`.trim()
killedBy: Should use customErrorName instead or error.name if customErrorName is set
statusReason: expected 'GraphQLError' to be 'MyCustomError' // Object.is equality

[Killed] MethodExpression
src/logger/CreateLogEntry.ts:40:13
     if (error) {
         logEntry.errorName = customErrorName ?? error.name
         logEntry.message =
-            `${logEntry.message} ${sanitizeMessage(error.message)}`.trim()
+            `${logEntry.message} ${sanitizeMessage(error.message)}`
         if (error.stack) {
             logEntry.stacktrace = sanitizeMessage(error.stack)
killedBy: Should remove white spaces at the beginning of the message
statusReason: expected ' `CustomerPayload` is an extension ty…' to be '`CustomerPayload` is an extension type' // Object.is equality

[Killed] ConditionalExpression
src/logger/CreateLogEntry.ts:41:13
         logEntry.errorName = customErrorName ?? error.name
         logEntry.message =
             `${logEntry.message} ${sanitizeMessage(error.message)}`.trim()
-        if (error.stack) {
+        if (false) {
             logEntry.stacktrace = sanitizeMessage(error.stack)
         }
killedBy: expects a correct logEntry is created for given 'A FetchError message' , 'ERROR' and FetchError: An error occurred while conne… { type: '…' }
statusReason: expected undefined to deeply equal StringContaining "FetchError: An error"

[Killed] ConditionalExpression
src/logger/CreateLogEntry.ts:41:13
         logEntry.errorName = customErrorName ?? error.name
         logEntry.message =
             `${logEntry.message} ${sanitizeMessage(error.message)}`.trim()
-        if (error.stack) {
+        if (true) {
             logEntry.stacktrace = sanitizeMessage(error.stack)
         }
killedBy: expects a correct logEntry is created for given 'A GraphQLError message' , 'ERROR' and Error: error
statusReason: Cannot read properties of undefined (reading 'includes')

[Killed] ConditionalExpression
src/logger/CreateLogEntry.ts:45:13
             logEntry.stacktrace = sanitizeMessage(error.stack)
         }
 
-        if (error instanceof GraphQLError) {
+        if (false) {
             if (error.extensions.query) {
                 logEntry.query = error.extensions.query as string
killedBy: expects a correct logEntry is created for given 'A GraphQLError message' , 'ERROR' and GraphQLError{ …(10) }
statusReason: expected 'ERROR' to be 'WARN' // Object.is equality

[Killed] ConditionalExpression
src/logger/CreateLogEntry.ts:45:13
             logEntry.stacktrace = sanitizeMessage(error.stack)
         }
 
-        if (error instanceof GraphQLError) {
+        if (true) {
             if (error.extensions.query) {
                 logEntry.query = error.extensions.query as string
killedBy: expects a correct logEntry is created for given 'A FetchError message' , 'ERROR' and FetchError: An error occurred while conne… { type: '…' }
statusReason: Cannot read properties of undefined (reading 'query')

[Killed] BlockStatement
src/logger/CreateLogEntry.ts:46:41
         }
 
         if (error instanceof GraphQLError) {
-            if (error.extensions.query) {
-                logEntry.query = error.extensions.query as string
-            } else if (error.source && error.source.body) {
+            if (error.extensions.query) {} else if (error.source && error.source.body) {
                 logEntry.query = error.source.body
             } else if (error.nodes) {
killedBy: expects a correct logEntry is created for given 'A GraphQLError message' , 'ERROR' and GraphQLError{ …(10) }
statusReason: expected undefined to deeply equal StringContaining "customer"

[Killed] ConditionalExpression
src/logger/CreateLogEntry.ts:46:17
         }
 
         if (error instanceof GraphQLError) {
-            if (error.extensions.query) {
+            if (false) {
                 logEntry.query = error.extensions.query as string
             } else if (error.source && error.source.body) {
killedBy: expects a correct logEntry is created for given 'A GraphQLError message' , 'ERROR' and GraphQLError{ …(10) }
statusReason: expected undefined to deeply equal StringContaining "customer"

[Killed] ConditionalExpression
src/logger/CreateLogEntry.ts:48:24
         if (error instanceof GraphQLError) {
             if (error.extensions.query) {
                 logEntry.query = error.extensions.query as string
-            } else if (error.source && error.source.body) {
+            } else if (false) {
                 logEntry.query = error.source.body
             } else if (error.nodes) {
killedBy: expects a correct logEntry is created for given 'A GraphQLError message' , 'ERROR' and GraphQLError{ …(10) }
statusReason: expected undefined to deeply equal StringContaining "customer"

[Killed] BlockStatement
src/logger/CreateLogEntry.ts:48:59
         if (error instanceof GraphQLError) {
             if (error.extensions.query) {
                 logEntry.query = error.extensions.query as string
-            } else if (error.source && error.source.body) {
-                logEntry.query = error.source.body
-            } else if (error.nodes) {
+            } else if (error.source && error.source.body) {} else if (error.nodes) {
                 logEntry.query = JSON.stringify(error.nodes)
             }
killedBy: expects a correct logEntry is created for given 'A GraphQLError message' , 'ERROR' and GraphQLError{ …(10) }
statusReason: expected undefined to deeply equal StringContaining "customer"

[Killed] ConditionalExpression
src/logger/CreateLogEntry.ts:50:24
                 logEntry.query = error.extensions.query as string
             } else if (error.source && error.source.body) {
                 logEntry.query = error.source.body
-            } else if (error.nodes) {
+            } else if (true) {
                 logEntry.query = JSON.stringify(error.nodes)
             }
killedBy: Should get error response when GraphQL context error occurs when calling execute function
statusReason: expected undefined to be 'query users{ users { userId userName …' // Object.is equality

[Killed] BlockStatement
src/logger/CreateLogEntry.ts:50:37
                 logEntry.query = error.extensions.query as string
             } else if (error.source && error.source.body) {
                 logEntry.query = error.source.body
-            } else if (error.nodes) {
-                logEntry.query = JSON.stringify(error.nodes)
-            }
+            } else if (error.nodes) {}
 
             if (error.extensions.serviceName) {
killedBy: expects a correct logEntry is created for given 'A GraphQLError message' , 'ERROR' and GraphQLError{ …(10) }
statusReason: expected undefined to deeply equal StringContaining "customer"

[Killed] BlockStatement
src/logger/CreateLogEntry.ts:54:47
                 logEntry.query = JSON.stringify(error.nodes)
             }
 
-            if (error.extensions.serviceName) {
-                logEntry.serviceName = error.extensions.serviceName as string
-                logEntry.level =
-                    error.extensions.serviceName === serviceName
-                        ? 'ERROR'
-                        : 'WARN'
-            }
+            if (error.extensions.serviceName) {}
 
             if (error.extensions.exception) {
killedBy: expects a correct logEntry is created for given 'A GraphQLError message' , 'ERROR' and GraphQLError{ …(10) }
statusReason: expected 'ERROR' to be 'WARN' // Object.is equality

[Killed] ConditionalExpression
src/logger/CreateLogEntry.ts:54:17
                 logEntry.query = JSON.stringify(error.nodes)
             }
 
-            if (error.extensions.serviceName) {
+            if (false) {
                 logEntry.serviceName = error.extensions.serviceName as string
                 logEntry.level =
killedBy: expects a correct logEntry is created for given 'A GraphQLError message' , 'ERROR' and GraphQLError{ …(10) }
statusReason: expected 'ERROR' to be 'WARN' // Object.is equality

[Killed] ConditionalExpression
src/logger/CreateLogEntry.ts:57:21
             if (error.extensions.serviceName) {
                 logEntry.serviceName = error.extensions.serviceName as string
                 logEntry.level =
-                    error.extensions.serviceName === serviceName
+                    true
                         ? 'ERROR'
                         : 'WARN'
killedBy: expects a correct logEntry is created for given 'A GraphQLError message' , 'ERROR' and GraphQLError{ …(10) }
statusReason: expected 'ERROR' to be 'WARN' // Object.is equality

[Killed] EqualityOperator
src/logger/CreateLogEntry.ts:57:21
             if (error.extensions.serviceName) {
                 logEntry.serviceName = error.extensions.serviceName as string
                 logEntry.level =
-                    error.extensions.serviceName === serviceName
+                    error.extensions.serviceName !== serviceName
                         ? 'ERROR'
                         : 'WARN'
killedBy: expects a correct logEntry is created for given 'A GraphQLError message' , 'ERROR' and GraphQLError{ …(10) }
statusReason: expected 'ERROR' to be 'WARN' // Object.is equality

[Killed] BlockStatement
src/logger/CreateLogEntry.ts:62:45
                         : 'WARN'
             }
 
-            if (error.extensions.exception) {
-                logEntry.stacktrace = sanitizeMessage(
-                    error.extensions.exception as string,
-                )
-            }
+            if (error.extensions.exception) {}
         }
     }
killedBy: expects a correct logEntry is created for given 'A GraphQLError message' , 'ERROR' and GraphQLError{ …(10) }
statusReason: expected 'GraphQLError: `CustomerPayload` is an…' to deeply equal StringContaining "A stacktrace"

[Killed] ConditionalExpression
src/logger/CreateLogEntry.ts:62:17
                         : 'WARN'
             }
 
-            if (error.extensions.exception) {
+            if (true) {
                 logEntry.stacktrace = sanitizeMessage(
                     error.extensions.exception as string,
killedBy: Should get error response when GraphQL context error occurs when calling execute function
statusReason: Cannot read properties of undefined (reading 'includes')
