[Killed] BlockStatement
src/logger/CreateTimestamp.ts:7:11
 
 function createISOTimestamp(
     dateFunction: DateFunction = nowDateFunction(),
-): string {
-    return dateFunction().toISOString()
-}
+): string {}
 
 export { createISOTimestamp }
killedBy: CreateISOTimestamp should create timestamp in ISO format
statusReason: expected undefined to be truthy
