[Killed] BooleanLiteral
src/logger/JsonLogger.ts:40:24
     constructor(
         loggerName: string,
         serviceName: string,
-        debugEnabled = false,
+        debugEnabled = true,
         truncateLimit = 0,
         truncatedText = '_TRUNCATED_',
killedBy: Creating a Logger should work with default options
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
src/logger/JsonLogger.ts:42:25
         serviceName: string,
         debugEnabled = false,
         truncateLimit = 0,
-        truncatedText = '_TRUNCATED_',
+        truncatedText = "",
         loggerConsole: Console = new Console(process.stdout, process.stderr),
     ) {
killedBy: Creating a Logger should work with default options
statusReason: expected '' to be '_TRUNCATED_' // Object.is equality

[Killed] BlockStatement
src/logger/JsonLogger.ts:44:7
         truncateLimit = 0,
         truncatedText = '_TRUNCATED_',
         loggerConsole: Console = new Console(process.stdout, process.stderr),
-    ) {
-        this.loggerName = loggerName
-        this.serviceName = serviceName
-        this.debugEnabled = debugEnabled
-        this.truncateLimit = truncateLimit
-        this.truncatedText = truncatedText
-        this.loggerConsole = loggerConsole
-    }
+    ) {}
 
     debug(
killedBy: Should get error response when GraphQL context error occurs when calling execute function
statusReason: Cannot read properties of undefined (reading 'log')

[Killed] BlockStatement
src/logger/JsonLogger.ts:57:13
         logMessage: string,
         context: Record<string, unknown>,
         dateFunction?: DateFunction,
-    ): void {
-        if (this.debugEnabled) {
-            this.logMessage({
-                context,
-                dateFunction,
-                logMessage,
-                loglevel: 'DEBUG',
-            })
-        }
-    }
+    ): void {}
 
     error(
killedBy: Should adjust execution result with data from mutation context info
statusReason: expected undefined to be 'mutation login{ login(userName:"magic…' // Object.is equality

[Killed] ConditionalExpression
src/logger/JsonLogger.ts:58:13
         context: Record<string, unknown>,
         dateFunction?: DateFunction,
     ): void {
-        if (this.debugEnabled) {
+        if (true) {
             this.logMessage({
                 context,
killedBy: Should get error response when GraphQL context error occurs when calling execute function
statusReason: expected undefined to be 'query users{ users { userId userName …' // Object.is equality

[Killed] ConditionalExpression
src/logger/JsonLogger.ts:58:13
         context: Record<string, unknown>,
         dateFunction?: DateFunction,
     ): void {
-        if (this.debugEnabled) {
+        if (false) {
             this.logMessage({
                 context,
killedBy: Should adjust execution result with data from mutation context info
statusReason: expected undefined to be 'mutation login{ login(userName:"magic…' // Object.is equality

[Killed] BlockStatement
src/logger/JsonLogger.ts:74:13
         error: Error,
         customErrorName: string,
         dateFunction?: DateFunction,
-    ): void {
-        this.logMessage({
-            context,
-            customErrorName,
-            dateFunction,
-            error,
-            logMessage,
-            loglevel: 'ERROR',
-        })
-    }
+    ): void {}
 
     info(
killedBy: Should get error response when GraphQL context error occurs when calling execute function
statusReason: expected undefined to be 'query users{ users { userId userName …' // Object.is equality

[Killed] BlockStatement
src/logger/JsonLogger.ts:89:13
         logMessage: string,
         context: Record<string, unknown>,
         dateFunction?: DateFunction,
-    ): void {
-        this.logMessage({
-            context,
-            dateFunction,
-            logMessage,
-            loglevel: 'INFO',
-        })
-    }
+    ): void {}
 
     warn(
killedBy: Should get error response when GraphQL context error occurs when calling execute function
statusReason: expected undefined to be 'query users{ users { userId userName …' // Object.is equality

[Killed] ObjectLiteral
src/logger/JsonLogger.ts:90:25
         context: Record<string, unknown>,
         dateFunction?: DateFunction,
     ): void {
-        this.logMessage({
-            context,
-            dateFunction,
-            logMessage,
-            loglevel: 'INFO',
-        })
+        this.logMessage({})
     }
 
killedBy: Should get error response when GraphQL context error occurs when calling execute function
statusReason: Cannot read properties of undefined (reading 'includes')

[Killed] BlockStatement
src/logger/JsonLogger.ts:102:13
         logMessage: string,
         context: Record<string, unknown>,
         dateFunction?: DateFunction,
-    ): void {
-        this.logMessage({
-            context,
-            dateFunction,
-            logMessage,
-            loglevel: 'WARN',
-        })
-    }
+    ): void {}
 
     createLogEntry(logEntryInput: LogEntryInput): LogEntry {
killedBy: Should not update schema when given schema is undefined
statusReason: expected 'Trying to set graphql schema' to be 'Schema update was rejected because co…' // Object.is equality

[Killed] BlockStatement
src/logger/JsonLogger.ts:111:60
         })
     }
 
-    createLogEntry(logEntryInput: LogEntryInput): LogEntry {
-        const {
-            dateFunction,
-            logMessage,
-            loglevel,
-            error,
-            customErrorName,
-            context,
-        } = logEntryInput
-
-        return truncateLogMessage(
-            createLogEntry({
-                context,
-                customErrorName,
-                dateFunction,
-                error,
-                logMessage,
-                loggerName: this.loggerName,
-                loglevel,
-                serviceName: this.serviceName,
-            }),
-            this.truncateLimit,
-            this.truncatedText,
-        )
-    }
+    createLogEntry(logEntryInput: LogEntryInput): LogEntry {}
 
     logMessage(logEntryInput: LogEntryInput): void {
killedBy: Should get error response when GraphQL context error occurs when calling execute function
statusReason: Cannot read properties of undefined (reading 'stacktrace')

[Killed] BlockStatement
src/logger/JsonLogger.ts:137:52
         )
     }
 
-    logMessage(logEntryInput: LogEntryInput): void {
-        this.loggerConsole.log(
-            JSON.stringify(this.createLogEntry(logEntryInput)),
-        )
-    }
+    logMessage(logEntryInput: LogEntryInput): void {}
 }
 
killedBy: Should get error response when GraphQL context error occurs when calling execute function
statusReason: expected undefined to be 'query users{ users { userId userName …' // Object.is equality
