[Killed] BlockStatement
src/logger/NoStacktraceJsonLogger.ts:5:60
 import { JsonLogger } from './JsonLogger'
 
 export class NoStacktraceJsonLogger extends JsonLogger {
-    createLogEntry(logEntryInput: LogEntryInput): LogEntry {
-        const logEntry = super.createLogEntry(logEntryInput)
-        logEntry.stacktrace = undefined
-        return logEntry
-    }
+    createLogEntry(logEntryInput: LogEntryInput): LogEntry {}
 }
 
killedBy: Debug entry should be written if debug is enabled
statusReason: Cannot set properties of undefined (setting 'timestamp')
