[Killed] BlockStatement
src/logger/NoStacktraceTextLogger.ts:8:15
     prepareLogOutput(
         logEntry: LogEntry,
         context: Record<string, unknown>,
-    ): string {
-        logEntry.stacktrace = undefined
-        return super.prepareLogOutput(logEntry, context)
-    }
+    ): string {}
 }
 
killedBy: logMessage should work even if no loglevel is provided
statusReason: expected undefined to be '1001-01-01T00:00:00.000Z [INFO]test-l…' // Object.is equality
