[Killed] BlockStatement
src/logger/TextLogger.ts:57:32
         context: Record<string, unknown>,
         dateFunction?: DateFunction,
     ): void {
-        if (this.debugEnabled) {
-            this.logMessage({
-                context,
-                dateFunction,
-                logMessage,
-                loglevel: 'DEBUG',
-            })
-        }
+        if (this.debugEnabled) {}
     }
 
killedBy: Debug entry should be written if debug is enabled
statusReason: expected undefined to be '1001-01-01T00:00:00.000Z [DEBUG]test-…' // Object.is equality

[Killed] ObjectLiteral
src/logger/TextLogger.ts:74:25
         customErrorName: string,
         dateFunction?: DateFunction,
     ): void {
-        this.logMessage({
-            context,
-            customErrorName,
-            dateFunction,
-            error,
-            logMessage,
-            loglevel: 'ERROR',
-        })
+        this.logMessage({})
     }
 
killedBy: Error entry should be written
statusReason: Cannot read properties of undefined (reading 'includes')

[Killed] ObjectLiteral
src/logger/TextLogger.ts:102:25
         context: Record<string, unknown>,
         dateFunction?: DateFunction,
     ): void {
-        this.logMessage({
-            context,
-            dateFunction,
-            logMessage,
-            loglevel: 'WARN',
-        })
+        this.logMessage({})
     }
 
killedBy: Warn entry should be written
statusReason: Cannot read properties of undefined (reading 'includes')

[Killed] ObjectLiteral
src/logger/TextLogger.ts:120:51
             context,
         } = logEntryInput
 
-        const logEntry: LogEntry = createLogEntry({
-            context,
-            customErrorName,
-            dateFunction,
-            error,
-            logMessage,
-            loggerName: this.loggerName,
-            loglevel: loglevel,
-            serviceName: this.serviceName,
-        })
+        const logEntry: LogEntry = createLogEntry({})
         this.loggerConsole.log(
             this.prepareLogOutput(
killedBy: Should set only default options if no options are provided
statusReason: Cannot read properties of undefined (reading 'includes')

[Killed] BlockStatement
src/logger/TextLogger.ts:152:15
     prepareLogOutput(
         logEntry: LogEntry,
         _context: Record<string, unknown>,
-    ): string {
-        return (
-            `${logEntry.timestamp} [${logEntry.level.toUpperCase()}]` +
-            `${this.loggerName}-${this.serviceName} :` +
-            logEntry.message +
-            (logEntry.stacktrace ? ` ${logEntry.stacktrace}` : '')
-        )
-    }
+    ): string {}
 }
 
killedBy: logMessage should work even if no loglevel is provided
statusReason: expected undefined to be '1001-01-01T00:00:00.000Z [INFO]test-l…' // Object.is equality

[Killed] MethodExpression
src/logger/TextLogger.ts:154:39
         _context: Record<string, unknown>,
     ): string {
         return (
-            `${logEntry.timestamp} [${logEntry.level.toUpperCase()}]` +
+            `${logEntry.timestamp} [${logEntry.level.toLowerCase()}]` +
             `${this.loggerName}-${this.serviceName} :` +
             logEntry.message +
killedBy: logMessage should work even if no loglevel is provided
statusReason: expected '1001-01-01T00:00:00.000Z [info]test-l…' to be '1001-01-01T00:00:00.000Z [INFO]test-l…' // Object.is equality

[Killed] ArithmeticOperator
src/logger/TextLogger.ts:154:13
         _context: Record<string, unknown>,
     ): string {
         return (
-            `${logEntry.timestamp} [${logEntry.level.toUpperCase()}]` +
-            `${this.loggerName}-${this.serviceName} :` +
-            logEntry.message +
-            (logEntry.stacktrace ? ` ${logEntry.stacktrace}` : '')
+            `${logEntry.timestamp} [${logEntry.level.toUpperCase()}]` + `${this.loggerName}-${this.serviceName} :` + logEntry.message - (logEntry.stacktrace ? ` ${logEntry.stacktrace}` : '')
         )
     }
killedBy: logMessage should work even if no loglevel is provided
statusReason: expected NaN to be '1001-01-01T00:00:00.000Z [INFO]test-l…' // Object.is equality
