[Killed] BlockStatement
src/logger/TruncateLogMessage.ts:7:13
     logEntry: LogEntry,
     truncateLimit = 0,
     truncatedText = '_TRUNCATED_',
-): LogEntry {
-    if (
-        truncateLimit > 0 &&
-        logEntry.message.length > truncateLimit + truncatedText.length
-    ) {
-        logEntry.message =
-            truncateLimit > truncatedText.length
-                ? logEntry.message.slice(
-                      0,
-                      truncateLimit - truncatedText.length,
-                  ) + truncatedText
-                : logEntry.message.slice(0, truncateLimit)
-    }
-    return logEntry
-}
+): LogEntry {}
 
killedBy: Should log errors if ServerResponse or StandardSchema have no correct implementation
statusReason: Cannot read properties of undefined (reading 'stacktrace')

[Killed] ConditionalExpression
src/logger/TruncateLogMessage.ts:9:9
     truncatedText = '_TRUNCATED_',
 ): LogEntry {
     if (
-        truncateLimit > 0 &&
-        logEntry.message.length > truncateLimit + truncatedText.length
+        false
     ) {
         logEntry.message =
killedBy: expects the log message to be truncated correctly for given '{"stack":"Error: 14 UNAVAILABLE: No c…' , undefined and 20
statusReason: expected '{"stack":"Error: 14 UNAVAILABLE: No c…' to be '{"stack":_TRUNCATED_' // Object.is equality

[Killed] LogicalOperator
src/logger/TruncateLogMessage.ts:9:9
     truncatedText = '_TRUNCATED_',
 ): LogEntry {
     if (
-        truncateLimit > 0 &&
-        logEntry.message.length > truncateLimit + truncatedText.length
+        truncateLimit > 0 || logEntry.message.length > truncateLimit + truncatedText.length
     ) {
         logEntry.message =
killedBy: Should not update schema when given schema is undefined
statusReason: expected '' to be 'Schema update was rejected because co…' // Object.is equality

[Killed] EqualityOperator
src/logger/TruncateLogMessage.ts:10:9
 ): LogEntry {
     if (
         truncateLimit > 0 &&
-        logEntry.message.length > truncateLimit + truncatedText.length
+        logEntry.message.length <= truncateLimit + truncatedText.length
     ) {
         logEntry.message =
killedBy: expects the log message to be truncated correctly for given '{"stack":"Error: 14 UNAVAILABLE: No c…' , undefined and 20
statusReason: expected '{"stack":"Error: 14 UNAVAILABLE: No c…' to be '{"stack":_TRUNCATED_' // Object.is equality

[Killed] ConditionalExpression
src/logger/TruncateLogMessage.ts:10:9
 ): LogEntry {
     if (
         truncateLimit > 0 &&
-        logEntry.message.length > truncateLimit + truncatedText.length
+        true
     ) {
         logEntry.message =
killedBy: expects the log message to be truncated correctly for given '{"stack":"Error: 14 UNAVAILABLE: No c…' , undefined and 2000
statusReason: expected '{"stack":"Error: 14 UNAVAILABLE: No c…' to be '{"stack":"Error: 14 UNAVAILABLE: No c…' // Object.is equality

[Killed] BlockStatement
src/logger/TruncateLogMessage.ts:11:7
     if (
         truncateLimit > 0 &&
         logEntry.message.length > truncateLimit + truncatedText.length
-    ) {
-        logEntry.message =
-            truncateLimit > truncatedText.length
-                ? logEntry.message.slice(
-                      0,
-                      truncateLimit - truncatedText.length,
-                  ) + truncatedText
-                : logEntry.message.slice(0, truncateLimit)
-    }
+    ) {}
     return logEntry
 }
killedBy: expects the log message to be truncated correctly for given '{"stack":"Error: 14 UNAVAILABLE: No c…' , undefined and 20
statusReason: expected '{"stack":"Error: 14 UNAVAILABLE: No c…' to be '{"stack":_TRUNCATED_' // Object.is equality

[Killed] ConditionalExpression
src/logger/TruncateLogMessage.ts:13:13
         logEntry.message.length > truncateLimit + truncatedText.length
     ) {
         logEntry.message =
-            truncateLimit > truncatedText.length
+            true
                 ? logEntry.message.slice(
                       0,
killedBy: expects the log message to be truncated correctly for given '{"stack":"Error: 14 UNAVAILABLE: No c…' , '_TRUNC_' and 7
statusReason: expected '_TRUNC_' to be '{"stack' // Object.is equality

[Killed] EqualityOperator
src/logger/TruncateLogMessage.ts:13:13
         logEntry.message.length > truncateLimit + truncatedText.length
     ) {
         logEntry.message =
-            truncateLimit > truncatedText.length
+            truncateLimit <= truncatedText.length
                 ? logEntry.message.slice(
                       0,
killedBy: expects the log message to be truncated correctly for given '{"stack":"Error: 14 UNAVAILABLE: No c…' , undefined and 20
statusReason: expected '{"stack":"Error: 14 ' to be '{"stack":_TRUNCATED_' // Object.is equality

[Killed] MethodExpression
src/logger/TruncateLogMessage.ts:14:19
     ) {
         logEntry.message =
             truncateLimit > truncatedText.length
-                ? logEntry.message.slice(
-                      0,
-                      truncateLimit - truncatedText.length,
-                  ) + truncatedText
+                ? logEntry.message + truncatedText
                 : logEntry.message.slice(0, truncateLimit)
     }
killedBy: expects the log message to be truncated correctly for given '{"stack":"Error: 14 UNAVAILABLE: No c…' , undefined and 20
statusReason: expected '{"stack":"Error: 14 UNAVAILABLE: No c…' to be '{"stack":_TRUNCATED_' // Object.is equality

[Killed] ArithmeticOperator
src/logger/TruncateLogMessage.ts:14:19
     ) {
         logEntry.message =
             truncateLimit > truncatedText.length
-                ? logEntry.message.slice(
-                      0,
-                      truncateLimit - truncatedText.length,
-                  ) + truncatedText
+                ? logEntry.message.slice(0, truncateLimit - truncatedText.length) - truncatedText
                 : logEntry.message.slice(0, truncateLimit)
     }
killedBy: expects the log message to be truncated correctly for given '{"stack":"Error: 14 UNAVAILABLE: No c…' , undefined and 20
statusReason: expected NaN to be '{"stack":_TRUNCATED_' // Object.is equality

[Killed] ArithmeticOperator
src/logger/TruncateLogMessage.ts:16:23
             truncateLimit > truncatedText.length
                 ? logEntry.message.slice(
                       0,
-                      truncateLimit - truncatedText.length,
+                      truncateLimit + truncatedText.length,
                   ) + truncatedText
                 : logEntry.message.slice(0, truncateLimit)
killedBy: expects the log message to be truncated correctly for given '{"stack":"Error: 14 UNAVAILABLE: No c…' , undefined and 20
statusReason: expected '{"stack":"Error: 14 UNAVAILABLE_TRUNC…' to be '{"stack":_TRUNCATED_' // Object.is equality

[Killed] MethodExpression
src/logger/TruncateLogMessage.ts:18:19
                       0,
                       truncateLimit - truncatedText.length,
                   ) + truncatedText
-                : logEntry.message.slice(0, truncateLimit)
+                : logEntry.message
     }
     return logEntry
killedBy: expects the log message to be truncated correctly for given '{"stack":"Error: 14 UNAVAILABLE: No c…' , '_TRUNC_' and 7
statusReason: expected '{"stack":"Error: 14 UNAVAILABLE: No c…' to be '{"stack' // Object.is equality
