[Killed] BlockStatement
src/metrics/IncreaseFetchOrGraphQLErrorMetric.ts:14:9
     error: unknown,
     serverOptions: GraphQLServerOptions,
     context: Record<string, unknown>,
-): void {
-    const { collectErrorMetricsFunction, logger } = serverOptions
-    logger.debug(
-        'Calling increaseFetchOrGraphQLErrorMetric' +
-            ` with error ${error} and errorIsFetch ${error instanceof Error}`,
-        context,
-    )
-    collectErrorMetricsFunction({
-        context,
-        error,
-        errorName: determineGraphQLOrFetchError(error),
-        serverOptions,
-    })
-}
+): void {}
 
killedBy: Should get correct metrics for SimpleMetricsClient
statusReason: expected '\n            # HELP graphql_server_r…' to contain 'graphql_server_errors{errorClass="Gra…'
