[Killed] BlockStatement
src/metrics/NoMetricsClient.ts:13:37
     setAvailability(): void {}
     increaseRequestThroughput(): void {}
     increaseErrors(): void {}
-    getMetricsContentType(): string {
-        return ''
-    }
+    getMetricsContentType(): string {}
     getMetrics(): Promise<string> {
         return new Promise((resolve) => {
killedBy: Should get no metrics for NoMetricsClient
statusReason: expected undefined to be '' // Object.is equality

[Killed] BlockStatement
src/metrics/NoMetricsClient.ts:16:35
     getMetricsContentType(): string {
         return ''
     }
-    getMetrics(): Promise<string> {
-        return new Promise((resolve) => {
-            resolve('')
-        })
-    }
+    getMetrics(): Promise<string> {}
 }
 
killedBy: Should get no metrics for NoMetricsClient
statusReason: expected undefined to be '' // Object.is equality

[Killed] BlockStatement
src/metrics/NoMetricsClient.ts:17:41
         return ''
     }
     getMetrics(): Promise<string> {
-        return new Promise((resolve) => {
-            resolve('')
-        })
+        return new Promise((resolve) => {})
     }
 }
killedBy: Should get no metrics for NoMetricsClient
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".
