[Killed] StringLiteral
src/metrics/SimpleMetricsClient.ts:29:39
     graphQLServerErrorCounter: Map<string, number> = new Map<string, number>()
 
     constructor(
-        requestThroughputMetricName = 'graphql_server_request_throughput',
+        requestThroughputMetricName = "",
         availabilityMetricName = 'graphql_server_availability',
         errorsMetricName = 'graphql_server_errors',
killedBy: Should get correct metrics for SimpleMetricsClient
statusReason: expected '\n            # HELP  Number of incom…' to contain 'graphql_server_request_throughput 0'

[Killed] BlockStatement
src/metrics/SimpleMetricsClient.ts:32:7
         requestThroughputMetricName = 'graphql_server_request_throughput',
         availabilityMetricName = 'graphql_server_availability',
         errorsMetricName = 'graphql_server_errors',
-    ) {
-        this.requestThroughputMetricName = requestThroughputMetricName
-        this.availabilityMetricName = availabilityMetricName
-        this.errorsMetricName = errorsMetricName
-        this.initMetrics()
-    }
+    ) {}
 
     initMetrics(): void {
killedBy: Should get correct metrics for SimpleMetricsClient
statusReason: expected '\n            # HELP undefined Number…' to contain 'graphql_server_availability 1'

[Killed] BlockStatement
src/metrics/SimpleMetricsClient.ts:39:25
         this.initMetrics()
     }
 
-    initMetrics(): void {
-        this.initErrorCounterLabels()
-    }
+    initMetrics(): void {}
 
     /**
killedBy: Should get correct metrics for SimpleMetricsClient
statusReason: expected '\n            # HELP graphql_server_r…' to contain 'graphql_server_errors{errorClass="Gra…'

[Killed] BlockStatement
src/metrics/SimpleMetricsClient.ts:50:36
      * Otherwise, calculating differences with functions like "increase" with
      * an undefined time series might not work for the first occurrence of an error.
      */
-    initErrorCounterLabels(): void {
-        this.graphQLServerErrorCounter.set(GRAPHQL_ERROR, 0)
-        this.graphQLServerErrorCounter.set(SCHEMA_VALIDATION_ERROR, 0)
-        this.graphQLServerErrorCounter.set(FETCH_ERROR, 0)
-        this.graphQLServerErrorCounter.set(METHOD_NOT_ALLOWED_ERROR, 0)
-        this.graphQLServerErrorCounter.set(INVALID_SCHEMA_ERROR, 0)
-        this.graphQLServerErrorCounter.set(MISSING_QUERY_PARAMETER_ERROR, 0)
-        this.graphQLServerErrorCounter.set(VALIDATION_ERROR, 0)
-        this.graphQLServerErrorCounter.set(SYNTAX_ERROR, 0)
-        this.graphQLServerErrorCounter.set(INTROSPECTION_DISABLED_ERROR, 0)
-    }
+    initErrorCounterLabels(): void {}
 
     increaseErrors(label: string): void {
killedBy: Should get correct metrics for SimpleMetricsClient
statusReason: expected '\n            # HELP graphql_server_r…' to contain 'graphql_server_errors{errorClass="Gra…'

[Killed] BlockStatement
src/metrics/SimpleMetricsClient.ts:62:41
         this.graphQLServerErrorCounter.set(INTROSPECTION_DISABLED_ERROR, 0)
     }
 
-    increaseErrors(label: string): void {
-        let errorCounter = this.graphQLServerErrorCounter.get(label)
-        if (errorCounter !== undefined) {
-            errorCounter++
-            this.graphQLServerErrorCounter.set(label, errorCounter)
-        }
-    }
+    increaseErrors(label: string): void {}
 
     increaseRequestThroughput(): void {
killedBy: Should get correct metrics for SimpleMetricsClient
statusReason: expected '\n            # HELP graphql_server_r…' to contain 'graphql_server_errors{errorClass="Sch…'

[Killed] BlockStatement
src/metrics/SimpleMetricsClient.ts:64:41
 
     increaseErrors(label: string): void {
         let errorCounter = this.graphQLServerErrorCounter.get(label)
-        if (errorCounter !== undefined) {
-            errorCounter++
-            this.graphQLServerErrorCounter.set(label, errorCounter)
-        }
+        if (errorCounter !== undefined) {}
     }
 
killedBy: Should get correct metrics for SimpleMetricsClient
statusReason: expected '\n            # HELP graphql_server_r…' to contain 'graphql_server_errors{errorClass="Sch…'

[Killed] ConditionalExpression
src/metrics/SimpleMetricsClient.ts:64:13
 
     increaseErrors(label: string): void {
         let errorCounter = this.graphQLServerErrorCounter.get(label)
-        if (errorCounter !== undefined) {
+        if (true) {
             errorCounter++
             this.graphQLServerErrorCounter.set(label, errorCounter)
killedBy: SimpleMetricsClient does not increase errors for unknown label
statusReason: expected 'graphql_server_errors{errorClass="unk…' to be 'graphql_server_errors{errorClass="unk…' // Object.is equality

[Killed] UpdateOperator
src/metrics/SimpleMetricsClient.ts:65:13
     increaseErrors(label: string): void {
         let errorCounter = this.graphQLServerErrorCounter.get(label)
         if (errorCounter !== undefined) {
-            errorCounter++
+            errorCounter--
             this.graphQLServerErrorCounter.set(label, errorCounter)
         }
killedBy: Should get correct metrics for SimpleMetricsClient
statusReason: expected '\n            # HELP graphql_server_r…' to contain 'graphql_server_errors{errorClass="Sch…'

[Killed] BlockStatement
src/metrics/SimpleMetricsClient.ts:70:39
         }
     }
 
-    increaseRequestThroughput(): void {
-        this.requestThroughput++
-    }
+    increaseRequestThroughput(): void {}
 
     setAvailability(value: number): void {
killedBy: Should get correct metrics for SimpleMetricsClient
statusReason: expected '\n            # HELP graphql_server_r…' to contain 'graphql_server_request_throughput 1'

[Killed] UpdateOperator
src/metrics/SimpleMetricsClient.ts:71:9
     }
 
     increaseRequestThroughput(): void {
-        this.requestThroughput++
+        this.requestThroughput--
     }
 
killedBy: Should get correct metrics for SimpleMetricsClient
statusReason: expected '\n            # HELP graphql_server_r…' to contain 'graphql_server_request_throughput 1'

[Killed] BlockStatement
src/metrics/SimpleMetricsClient.ts:74:42
         this.requestThroughput++
     }
 
-    setAvailability(value: number): void {
-        this.graphQLServerAvailabilityGauge = value
-    }
+    setAvailability(value: number): void {}
 
     getMetricsContentType(): string {
killedBy: Should get correct metrics for SimpleMetricsClient
statusReason: expected '\n            # HELP graphql_server_r…' to contain 'graphql_server_availability 1'

[Killed] BlockStatement
src/metrics/SimpleMetricsClient.ts:78:37
         this.graphQLServerAvailabilityGauge = value
     }
 
-    getMetricsContentType(): string {
-        return 'text/plain; charset=utf-8; version=0.0.4'
-    }
+    getMetricsContentType(): string {}
 
     getErrorCount(errorLabel: string): string {
killedBy: Should get correct metrics for SimpleMetricsClient
statusReason: expected undefined to be 'text/plain; charset=utf-8; version=0.…' // Object.is equality

[Killed] BlockStatement
src/metrics/SimpleMetricsClient.ts:82:47
         return 'text/plain; charset=utf-8; version=0.0.4'
     }
 
-    getErrorCount(errorLabel: string): string {
-        return (
-            `${this.errorsMetricName}{errorClass="${errorLabel}"} ` +
-            this.graphQLServerErrorCounter.get(errorLabel)
-        )
-    }
+    getErrorCount(errorLabel: string): string {}
 
     async getMetrics(): Promise<string> {
killedBy: Should get correct metrics for SimpleMetricsClient
statusReason: expected '\n            # HELP graphql_server_r…' to contain 'graphql_server_errors{errorClass="Gra…'

[Killed] StringLiteral
src/metrics/SimpleMetricsClient.ts:84:13
 
     getErrorCount(errorLabel: string): string {
         return (
-            `${this.errorsMetricName}{errorClass="${errorLabel}"} ` +
+            `` +
             this.graphQLServerErrorCounter.get(errorLabel)
         )
killedBy: Should get correct metrics for SimpleMetricsClient
statusReason: expected '\n            # HELP graphql_server_r…' to contain 'graphql_server_errors{errorClass="Gra…'

[Killed] BlockStatement
src/metrics/SimpleMetricsClient.ts:89:41
         )
     }
 
-    async getMetrics(): Promise<string> {
-        return new Promise((resolve) => {
-            resolve(`
-            # HELP ${this.requestThroughputMetricName} Number of incoming requests
-            # TYPE ${this.requestThroughputMetricName} counter
-            ${this.requestThroughputMetricName} ${this.requestThroughput}
-            # HELP ${this.availabilityMetricName}  GraphQL server availability
-            # TYPE ${this.availabilityMetricName}  gauge
-            ${this.availabilityMetricName} ${this.graphQLServerAvailabilityGauge}
-            # HELP ${this.errorsMetricName} Number of errors per Error class
-            # TYPE ${this.errorsMetricName} counter
-            ${this.getErrorCount(GRAPHQL_ERROR)}
-            ${this.getErrorCount(SCHEMA_VALIDATION_ERROR)}
-            ${this.getErrorCount(FETCH_ERROR)}
-            ${this.getErrorCount(METHOD_NOT_ALLOWED_ERROR)}
-            ${this.getErrorCount(INVALID_SCHEMA_ERROR)}
-            ${this.getErrorCount(MISSING_QUERY_PARAMETER_ERROR)}
-            ${this.getErrorCount(VALIDATION_ERROR)}
-            ${this.getErrorCount(SYNTAX_ERROR)}
-            ${this.getErrorCount(INTROSPECTION_DISABLED_ERROR)}
-            `)
-        })
-    }
+    async getMetrics(): Promise<string> {}
 }
 
killedBy: Should get correct metrics for SimpleMetricsClient
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] BlockStatement
src/metrics/SimpleMetricsClient.ts:90:41
     }
 
     async getMetrics(): Promise<string> {
-        return new Promise((resolve) => {
-            resolve(`
-            # HELP ${this.requestThroughputMetricName} Number of incoming requests
-            # TYPE ${this.requestThroughputMetricName} counter
-            ${this.requestThroughputMetricName} ${this.requestThroughput}
-            # HELP ${this.availabilityMetricName}  GraphQL server availability
-            # TYPE ${this.availabilityMetricName}  gauge
-            ${this.availabilityMetricName} ${this.graphQLServerAvailabilityGauge}
-            # HELP ${this.errorsMetricName} Number of errors per Error class
-            # TYPE ${this.errorsMetricName} counter
-            ${this.getErrorCount(GRAPHQL_ERROR)}
-            ${this.getErrorCount(SCHEMA_VALIDATION_ERROR)}
-            ${this.getErrorCount(FETCH_ERROR)}
-            ${this.getErrorCount(METHOD_NOT_ALLOWED_ERROR)}
-            ${this.getErrorCount(INVALID_SCHEMA_ERROR)}
-            ${this.getErrorCount(MISSING_QUERY_PARAMETER_ERROR)}
-            ${this.getErrorCount(VALIDATION_ERROR)}
-            ${this.getErrorCount(SYNTAX_ERROR)}
-            ${this.getErrorCount(INTROSPECTION_DISABLED_ERROR)}
-            `)
-        })
+        return new Promise((resolve) => {})
     }
 }
killedBy: Should get correct metrics for SimpleMetricsClient
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".
