[Killed] BlockStatement
src/request/ExtractInformationFromRequest.ts:11:32
 
 async function extractInformationFromRequest(
     request: GraphQLServerRequest,
-): Promise<GraphQLRequestInfo> {
-    const extractedURLParameters = extractInformationFromUrlParameters(
-        request.url ?? '',
-    )
-    const extractedBody = await extractInformationFromBody(request)
-    return {
-        error: extractedBody.error,
-        operationName:
-            extractedURLParameters.operationName ?? extractedBody.operationName,
-        query: extractedURLParameters.query ?? extractedBody.query,
-        variables: extractedURLParameters.variables ?? extractedBody.variables,
-    }
-}
+): Promise<GraphQLRequestInfo> {}
 
 function extractInformationFromUrlParameters(url: string): GraphQLRequestInfo {
killedBy: Should get correct metrics for SimpleMetricsClient
statusReason: Cannot use 'in' operator to search for 'query' in undefined

[Killed] LogicalOperator
src/request/ExtractInformationFromRequest.ts:13:9
     request: GraphQLServerRequest,
 ): Promise<GraphQLRequestInfo> {
     const extractedURLParameters = extractInformationFromUrlParameters(
-        request.url ?? '',
+        request.url && '',
     )
     const extractedBody = await extractInformationFromBody(request)
killedBy: Should get data response
statusReason: Cannot read properties of undefined (reading 'slice')

[Survived] LogicalOperator
src/request/ExtractInformationFromRequest.ts:19:13
     return {
         error: extractedBody.error,
         operationName:
-            extractedURLParameters.operationName ?? extractedBody.operationName,
+            extractedURLParameters.operationName && extractedBody.operationName,
         query: extractedURLParameters.query ?? extractedBody.query,
         variables: extractedURLParameters.variables ?? extractedBody.variables,

[Killed] LogicalOperator
src/request/ExtractInformationFromRequest.ts:20:16
         error: extractedBody.error,
         operationName:
             extractedURLParameters.operationName ?? extractedBody.operationName,
-        query: extractedURLParameters.query ?? extractedBody.query,
+        query: extractedURLParameters.query && extractedBody.query,
         variables: extractedURLParameters.variables ?? extractedBody.variables,
     }
killedBy: Should get data response
statusReason: Cannot read properties of undefined (reading 'users')

[Killed] LogicalOperator
src/request/ExtractInformationFromRequest.ts:21:20
         operationName:
             extractedURLParameters.operationName ?? extractedBody.operationName,
         query: extractedURLParameters.query ?? extractedBody.query,
-        variables: extractedURLParameters.variables ?? extractedBody.variables,
+        variables: extractedURLParameters.variables && extractedBody.variables,
     }
 }
killedBy: Should get data response for query with variables
statusReason: Cannot read properties of undefined (reading 'user')

[Killed] BlockStatement
src/request/ExtractInformationFromRequest.ts:25:79
     }
 }
 
-function extractInformationFromUrlParameters(url: string): GraphQLRequestInfo {
-    const urlParameters = new URLSearchParams(
-        url.slice(Math.max(0, url.indexOf('?'))),
-    )
-    const extractedQuery = urlParameters.get('query') ?? undefined
-    const extractedVariables =
-        (urlParameters.get('variables') as Readonly<
-            Record<string, unknown>
-        > | null) || undefined
-    const extractedOperationName =
-        urlParameters.get('operationName') ?? undefined
-    return {
-        operationName: extractedOperationName,
-        query: extractedQuery,
-        variables: extractedVariables,
-    }
-}
+function extractInformationFromUrlParameters(url: string): GraphQLRequestInfo {}
 
 /** Extracts information from request body. Based on implementation from express-graphql */
killedBy: Should get correct metrics for SimpleMetricsClient
statusReason: Cannot read properties of undefined (reading 'operationName')

[Killed] MethodExpression
src/request/ExtractInformationFromRequest.ts:27:9
 
 function extractInformationFromUrlParameters(url: string): GraphQLRequestInfo {
     const urlParameters = new URLSearchParams(
-        url.slice(Math.max(0, url.indexOf('?'))),
+        url,
     )
     const extractedQuery = urlParameters.get('query') ?? undefined
killedBy: Should get data response when using GET request
statusReason: Cannot read properties of undefined (reading 'users')

[Killed] MethodExpression
src/request/ExtractInformationFromRequest.ts:27:19
 
 function extractInformationFromUrlParameters(url: string): GraphQLRequestInfo {
     const urlParameters = new URLSearchParams(
-        url.slice(Math.max(0, url.indexOf('?'))),
+        url.slice(Math.min(0, url.indexOf('?'))),
     )
     const extractedQuery = urlParameters.get('query') ?? undefined
killedBy: Should get data response when using GET request
statusReason: Cannot read properties of undefined (reading 'users')

[Killed] LogicalOperator
src/request/ExtractInformationFromRequest.ts:29:28
     const urlParameters = new URLSearchParams(
         url.slice(Math.max(0, url.indexOf('?'))),
     )
-    const extractedQuery = urlParameters.get('query') ?? undefined
+    const extractedQuery = urlParameters.get('query') && undefined
     const extractedVariables =
         (urlParameters.get('variables') as Readonly<
killedBy: Should get data response when using GET request
statusReason: Cannot read properties of undefined (reading 'users')

[Killed] StringLiteral
src/request/ExtractInformationFromRequest.ts:29:46
     const urlParameters = new URLSearchParams(
         url.slice(Math.max(0, url.indexOf('?'))),
     )
-    const extractedQuery = urlParameters.get('query') ?? undefined
+    const extractedQuery = urlParameters.get("") ?? undefined
     const extractedVariables =
         (urlParameters.get('variables') as Readonly<
killedBy: Should get data response when using GET request
statusReason: Cannot read properties of undefined (reading 'users')

[Killed] ConditionalExpression
src/request/ExtractInformationFromRequest.ts:31:9
     )
     const extractedQuery = urlParameters.get('query') ?? undefined
     const extractedVariables =
-        (urlParameters.get('variables') as Readonly<
-            Record<string, unknown>
-        > | null) || undefined
+        false
     const extractedOperationName =
         urlParameters.get('operationName') ?? undefined
killedBy: Should get data response
statusReason: error.toJSON is not a function

[Killed] LogicalOperator
src/request/ExtractInformationFromRequest.ts:31:9
     )
     const extractedQuery = urlParameters.get('query') ?? undefined
     const extractedVariables =
-        (urlParameters.get('variables') as Readonly<
-            Record<string, unknown>
-        > | null) || undefined
+        urlParameters.get('variables') as Readonly<Record<string, unknown>> | null && undefined
     const extractedOperationName =
         urlParameters.get('operationName') ?? undefined
killedBy: Test that request information is extracted correctly from url parameters expects for request { operationName: 'users', …(1) } to extract values correctly
statusReason: expected null to be undefined // Object.is equality

[Killed] LogicalOperator
src/request/ExtractInformationFromRequest.ts:35:9
             Record<string, unknown>
         > | null) || undefined
     const extractedOperationName =
-        urlParameters.get('operationName') ?? undefined
+        urlParameters.get('operationName') && undefined
     return {
         operationName: extractedOperationName,
killedBy: Test that request information is extracted correctly from url parameters expects for request { operationName: 'users', …(1) } to extract values correctly
statusReason: expected undefined to be 'users' // Object.is equality

[Killed] StringLiteral
src/request/ExtractInformationFromRequest.ts:35:27
             Record<string, unknown>
         > | null) || undefined
     const extractedOperationName =
-        urlParameters.get('operationName') ?? undefined
+        urlParameters.get("") ?? undefined
     return {
         operationName: extractedOperationName,
killedBy: Test that request information is extracted correctly from url parameters expects for request { operationName: 'users', …(1) } to extract values correctly
statusReason: expected undefined to be 'users' // Object.is equality

[Killed] ObjectLiteral
src/request/ExtractInformationFromRequest.ts:36:12
         > | null) || undefined
     const extractedOperationName =
         urlParameters.get('operationName') ?? undefined
-    return {
-        operationName: extractedOperationName,
-        query: extractedQuery,
-        variables: extractedVariables,
-    }
+    return {}
 }
 
killedBy: Should get data response when using GET request
statusReason: Cannot read properties of undefined (reading 'users')

[Killed] ConditionalExpression
src/request/ExtractInformationFromRequest.ts:48:27
     request: GraphQLServerRequest,
 ): Promise<GraphQLRequestInfo> {
     // Do not try to read body for GET requests
-    if (request.method && request.method === 'GET') {
+    if (request.method && true) {
         return {}
     }
killedBy: Should get data response
statusReason: Cannot read properties of undefined (reading 'users')

[Killed] ConditionalExpression
src/request/ExtractInformationFromRequest.ts:48:9
     request: GraphQLServerRequest,
 ): Promise<GraphQLRequestInfo> {
     // Do not try to read body for GET requests
-    if (request.method && request.method === 'GET') {
+    if (false) {
         return {}
     }
killedBy: Should get an error response when no query parameter is found
statusReason: expected 'POST body contains invalid type undef…' to be 'Request cannot be processed. No query…' // Object.is equality

[Killed] BlockStatement
src/request/ExtractInformationFromRequest.ts:53:32
     }
 
     let { body } = request
-    if (!body && request.text) {
-        body = await request.text()
-    }
+    if (!body && request.text) {}
     const bodyIsObject = typeof body === 'object'
 
killedBy: Should extract body with request.text if body is undefined
statusReason: expected undefined to be '{"query":"findTheQuery"}' // Object.is equality

[Killed] BooleanLiteral
src/request/ExtractInformationFromRequest.ts:53:9
     }
 
     let { body } = request
-    if (!body && request.text) {
+    if (body && request.text) {
         body = await request.text()
     }
killedBy: Should extract body with request.text if body is undefined
statusReason: expected undefined to be '{"query":"findTheQuery"}' // Object.is equality

[Killed] ConditionalExpression
src/request/ExtractInformationFromRequest.ts:56:26
     if (!body && request.text) {
         body = await request.text()
     }
-    const bodyIsObject = typeof body === 'object'
+    const bodyIsObject = true
 
     if (!body) {
killedBy: Get fitting error if body type contains invalid type
statusReason: expected 'Invalid request. Request header conte…' to be 'POST body contains invalid type boole…' // Object.is equality

[Killed] ConditionalExpression
src/request/ExtractInformationFromRequest.ts:56:26
     if (!body && request.text) {
         body = await request.text()
     }
-    const bodyIsObject = typeof body === 'object'
+    const bodyIsObject = false
 
     if (!body) {
killedBy: Get fitting error if body contains a Buffer
statusReason: expected 'POST body contains invalid type objec…' to be 'Cannot extract information from body …' // Object.is equality

[Killed] BooleanLiteral
src/request/ExtractInformationFromRequest.ts:58:9
     }
     const bodyIsObject = typeof body === 'object'
 
-    if (!body) {
+    if (body) {
         return {
             error: {
killedBy: Should get data response
statusReason: Cannot read properties of undefined (reading 'users')

[Killed] BlockStatement
src/request/ExtractInformationFromRequest.ts:58:16
     }
     const bodyIsObject = typeof body === 'object'
 
-    if (!body) {
-        return {
-            error: {
-                graphQLError: new GraphQLError('POST body is empty.', {}),
-                statusCode: 400,
-            },
-        }
-    } else if (typeof body !== 'string' && !bodyIsObject) {
+    if (!body) {} else if (typeof body !== 'string' && !bodyIsObject) {
         return {
             error: {
killedBy: Get fitting error if body is empty
statusReason: expected 'Invalid request. Request header conte…' to be 'POST body is empty.' // Object.is equality

[Killed] StringLiteral
src/request/ExtractInformationFromRequest.ts:61:48
     if (!body) {
         return {
             error: {
-                graphQLError: new GraphQLError('POST body is empty.', {}),
+                graphQLError: new GraphQLError("", {}),
                 statusCode: 400,
             },
killedBy: Get fitting error if body is empty
statusReason: expected '' to be 'POST body is empty.' // Object.is equality

[Killed] LogicalOperator
src/request/ExtractInformationFromRequest.ts:65:16
                 statusCode: 400,
             },
         }
-    } else if (typeof body !== 'string' && !bodyIsObject) {
+    } else if (typeof body !== 'string' || !bodyIsObject) {
         return {
             error: {
killedBy: Should get data response
statusReason: Cannot read properties of undefined (reading 'users')

[Killed] ConditionalExpression
src/request/ExtractInformationFromRequest.ts:65:16
                 statusCode: 400,
             },
         }
-    } else if (typeof body !== 'string' && !bodyIsObject) {
+    } else if (false) {
         return {
             error: {
killedBy: Get fitting error if body type contains invalid type
statusReason: expected 'Invalid request. Request header conte…' to be 'POST body contains invalid type boole…' // Object.is equality

[Killed] ObjectLiteral
src/request/ExtractInformationFromRequest.ts:67:20
         }
     } else if (typeof body !== 'string' && !bodyIsObject) {
         return {
-            error: {
-                graphQLError: new GraphQLError(
-                    `POST body contains invalid type ${typeof body}. ` +
-                        'Only "object" and "string" are supported.',
-                    {},
-                ),
-                statusCode: 400,
-            },
+            error: {},
         }
     } else if (bodyIsObject && body instanceof Uint8Array) {
killedBy: Get fitting error if body type contains invalid type
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
src/request/ExtractInformationFromRequest.ts:70:25
             error: {
                 graphQLError: new GraphQLError(
                     `POST body contains invalid type ${typeof body}. ` +
-                        'Only "object" and "string" are supported.',
+                        "",
                     {},
                 ),
killedBy: Get fitting error if body type contains invalid type
statusReason: expected 'POST body contains invalid type boole…' to be 'POST body contains invalid type boole…' // Object.is equality

[Killed] LogicalOperator
src/request/ExtractInformationFromRequest.ts:76:16
                 statusCode: 400,
             },
         }
-    } else if (bodyIsObject && body instanceof Uint8Array) {
+    } else if (bodyIsObject || body instanceof Uint8Array) {
         return {
             error: {
killedBy: Should properly extract query from body for graphql request
statusReason: expected undefined to be '{"query":"findTheQuery"}' // Object.is equality

[Killed] ConditionalExpression
src/request/ExtractInformationFromRequest.ts:76:16
                 statusCode: 400,
             },
         }
-    } else if (bodyIsObject && body instanceof Uint8Array) {
+    } else if (false) {
         return {
             error: {
killedBy: Get fitting error if body contains a Buffer
statusReason: expected 'Invalid request. Request header conte…' to be 'Cannot extract information from body …' // Object.is equality

[Killed] ObjectLiteral
src/request/ExtractInformationFromRequest.ts:77:16
             },
         }
     } else if (bodyIsObject && body instanceof Uint8Array) {
-        return {
-            error: {
-                graphQLError: new GraphQLError(
-                    'Cannot extract information from ' +
-                        'body because it contains an object buffer!',
-                    {},
-                ),
-                statusCode: 400,
-            },
-        }
+        return {}
     }
 
killedBy: Get fitting error if body contains a Buffer
statusReason: expected undefined to be 'Cannot extract information from body …' // Object.is equality

[Killed] ConditionalExpression
src/request/ExtractInformationFromRequest.ts:92:9
     // eslint-disable-next-line unicorn/consistent-destructuring
     const contentTypeFromHeader = request.headers['content-type']
 
-    if (contentTypeFromHeader === undefined) {
+    if (true) {
         return {
             error: {
killedBy: Should get data response
statusReason: Cannot read properties of undefined (reading 'users')

[Killed] ConditionalExpression
src/request/ExtractInformationFromRequest.ts:92:9
     // eslint-disable-next-line unicorn/consistent-destructuring
     const contentTypeFromHeader = request.headers['content-type']
 
-    if (contentTypeFromHeader === undefined) {
+    if (false) {
         return {
             error: {
killedBy: Should get an error response when content type is not defined
statusReason: expected 'POST body contains invalid content ty…' to be 'Invalid request. Request header conte…' // Object.is equality

[Killed] ObjectLiteral
src/request/ExtractInformationFromRequest.ts:93:16
     const contentTypeFromHeader = request.headers['content-type']
 
     if (contentTypeFromHeader === undefined) {
-        return {
-            error: {
-                graphQLError: new GraphQLError(
-                    'Invalid request. ' +
-                        'Request header content-type is undefined.',
-                    {},
-                ),
-                statusCode: 400,
-            },
-        }
+        return {}
     }
 
killedBy: Should get an error response when content type is not defined
statusReason: expected 'Request cannot be processed. No query…' to be 'Invalid request. Request header conte…' // Object.is equality

[Killed] ObjectLiteral
src/request/ExtractInformationFromRequest.ts:94:20
 
     if (contentTypeFromHeader === undefined) {
         return {
-            error: {
-                graphQLError: new GraphQLError(
-                    'Invalid request. ' +
-                        'Request header content-type is undefined.',
-                    {},
-                ),
-                statusCode: 400,
-            },
+            error: {},
         }
     }
killedBy: Should get an error response when content type is not defined
statusReason: Cannot read properties of undefined (reading 'toJSON')

[Killed] StringLiteral
src/request/ExtractInformationFromRequest.ts:96:21
         return {
             error: {
                 graphQLError: new GraphQLError(
-                    'Invalid request. ' +
+                    "" +
                         'Request header content-type is undefined.',
                     {},
killedBy: Should get an error response when content type is not defined
statusReason: expected 'Request header content-type is undefi…' to be 'Invalid request. Request header conte…' // Object.is equality

[Killed] ConditionalExpression
src/request/ExtractInformationFromRequest.ts:107:9
 
     const contentType = getContentType(contentTypeFromHeader)
     switch (contentType) {
-        case 'application/graphql':
-            return {
-                query: typeof body === 'string' ? body : JSON.stringify(body),
-            }
+        case 'application/graphql':
         case 'application/json':
             if (typeof body === 'string') {
killedBy: Should properly extract query from body for graphql request
statusReason: expected 'findTheQuery' to be '{"query":"findTheQuery"}' // Object.is equality

[Killed] EqualityOperator
src/request/ExtractInformationFromRequest.ts:109:24
     switch (contentType) {
         case 'application/graphql':
             return {
-                query: typeof body === 'string' ? body : JSON.stringify(body),
+                query: typeof body !== 'string' ? body : JSON.stringify(body),
             }
         case 'application/json':
killedBy: Should properly extract query from body for graphql request
statusReason: expected { query: 'findTheQuery' } to be '{"query":"findTheQuery"}' // Object.is equality

[Killed] ConditionalExpression
src/request/ExtractInformationFromRequest.ts:109:24
     switch (contentType) {
         case 'application/graphql':
             return {
-                query: typeof body === 'string' ? body : JSON.stringify(body),
+                query: true ? body : JSON.stringify(body),
             }
         case 'application/json':
killedBy: Should properly extract query from body for graphql request
statusReason: expected { query: 'findTheQuery' } to be '{"query":"findTheQuery"}' // Object.is equality

[Killed] ConditionalExpression
src/request/ExtractInformationFromRequest.ts:112:17
                 query: typeof body === 'string' ? body : JSON.stringify(body),
             }
         case 'application/json':
-            if (typeof body === 'string') {
+            if (false) {
                 try {
                     const bodyAsJson = JSON.parse(body)
killedBy: Should get data response
statusReason: Cannot read properties of undefined (reading 'users')

[Killed] BlockStatement
src/request/ExtractInformationFromRequest.ts:112:43
                 query: typeof body === 'string' ? body : JSON.stringify(body),
             }
         case 'application/json':
-            if (typeof body === 'string') {
-                try {
-                    const bodyAsJson = JSON.parse(body)
-                    return {
-                        operationName: bodyAsJson.operationName,
-                        query: bodyAsJson.query,
-                        variables:
-                            (bodyAsJson.variables as Readonly<
-                                Record<string, unknown>
-                            > | null) || undefined,
-                    }
-                } catch {
-                    return {
-                        error: {
-                            graphQLError: new GraphQLError(
-                                'POST body contains invalid JSON.',
-                                {},
-                            ),
-                            statusCode: 400,
-                        },
-                    }
-                }
-            } else {
+            if (typeof body === 'string') {} else {
                 const bodyAsMap = body as Record<string, unknown>
                 return {
killedBy: Should return error if context serviceName is different as graphql server serviceName
statusReason: expected 'Request cannot be processed. No query…' to be 'Something went wrong!' // Object.is equality

[Killed] BlockStatement
src/request/ExtractInformationFromRequest.ts:113:21
             }
         case 'application/json':
             if (typeof body === 'string') {
-                try {
-                    const bodyAsJson = JSON.parse(body)
-                    return {
-                        operationName: bodyAsJson.operationName,
-                        query: bodyAsJson.query,
-                        variables:
-                            (bodyAsJson.variables as Readonly<
-                                Record<string, unknown>
-                            > | null) || undefined,
-                    }
-                } catch {
+                try {} catch {
                     return {
                         error: {
killedBy: Should get data response
statusReason: Cannot read properties of undefined (reading 'users')

[Killed] ConditionalExpression
src/request/ExtractInformationFromRequest.ts:119:29
                         operationName: bodyAsJson.operationName,
                         query: bodyAsJson.query,
                         variables:
-                            (bodyAsJson.variables as Readonly<
-                                Record<string, unknown>
-                            > | null) || undefined,
+                            false,
                     }
                 } catch {
killedBy: Should get data response
statusReason: error.toJSON is not a function

[Killed] ConditionalExpression
src/request/ExtractInformationFromRequest.ts:119:29
                         operationName: bodyAsJson.operationName,
                         query: bodyAsJson.query,
                         variables:
-                            (bodyAsJson.variables as Readonly<
-                                Record<string, unknown>
-                            > | null) || undefined,
+                            true,
                     }
                 } catch {
killedBy: Should get data response
statusReason: error.toJSON is not a function

[Killed] BlockStatement
src/request/ExtractInformationFromRequest.ts:123:25
                                 Record<string, unknown>
                             > | null) || undefined,
                     }
-                } catch {
-                    return {
-                        error: {
-                            graphQLError: new GraphQLError(
-                                'POST body contains invalid JSON.',
-                                {},
-                            ),
-                            statusCode: 400,
-                        },
-                    }
-                }
+                } catch {}
             } else {
                 const bodyAsMap = body as Record<string, unknown>
killedBy: Should get error response if body contains invalid json
statusReason: expected 'Request cannot be processed. No query…' to be 'POST body contains invalid JSON.' // Object.is equality

[Survived] BlockStatement
src/request/ExtractInformationFromRequest.ts:134:20
                         },
                     }
                 }
-            } else {
-                const bodyAsMap = body as Record<string, unknown>
-                return {
-                    operationName: bodyAsMap.operationName as string,
-                    query: bodyAsMap.query as string,
-                    variables:
-                        (bodyAsMap.variables as Readonly<
-                            Record<string, unknown>
-                        > | null) || undefined,
-                }
-            }
+            } else {}
         case 'application/x-www-form-urlencoded':
             return extractInformationFromUrlParameters(`host?${body}.`)

[Survived] ConditionalExpression
src/request/ExtractInformationFromRequest.ts:140:25
                     operationName: bodyAsMap.operationName as string,
                     query: bodyAsMap.query as string,
                     variables:
-                        (bodyAsMap.variables as Readonly<
-                            Record<string, unknown>
-                        > | null) || undefined,
+                        true,
                 }
             }

[Survived] LogicalOperator
src/request/ExtractInformationFromRequest.ts:140:25
                     operationName: bodyAsMap.operationName as string,
                     query: bodyAsMap.query as string,
                     variables:
-                        (bodyAsMap.variables as Readonly<
-                            Record<string, unknown>
-                        > | null) || undefined,
+                        bodyAsMap.variables as Readonly<Record<string, unknown>> | null && undefined,
                 }
             }

[Killed] ConditionalExpression
src/request/ExtractInformationFromRequest.ts:145:9
                         > | null) || undefined,
                 }
             }
-        case 'application/x-www-form-urlencoded':
-            return extractInformationFromUrlParameters(`host?${body}.`)
+        case 'application/x-www-form-urlencoded':
         default:
             return {
killedBy: Should get data response when using urlencoded request
statusReason: Cannot read properties of undefined (reading 'users')

[Killed] StringLiteral
src/request/ExtractInformationFromRequest.ts:145:14
                         > | null) || undefined,
                 }
             }
-        case 'application/x-www-form-urlencoded':
+        case "":
             return extractInformationFromUrlParameters(`host?${body}.`)
         default:
killedBy: Should get error response if content type cannot be processed
statusReason: expected 'Request cannot be processed. No query…' to be 'POST body contains invalid content ty…' // Object.is equality

[Killed] StringLiteral
src/request/ExtractInformationFromRequest.ts:146:56
                 }
             }
         case 'application/x-www-form-urlencoded':
-            return extractInformationFromUrlParameters(`host?${body}.`)
+            return extractInformationFromUrlParameters(``)
         default:
             return {
killedBy: Should get data response when using urlencoded request
statusReason: Cannot read properties of undefined (reading 'users')
