[Killed] ConditionalExpression
src/request/ExtractInformationFromRequest.ts:147:9
             }
         case 'application/x-www-form-urlencoded':
             return extractInformationFromUrlParameters(`host?${body}.`)
-        default:
-            return {
-                error: {
-                    graphQLError: new GraphQLError(
-                        'POST body contains invalid content type: ' +
-                            // eslint-disable-next-line unicorn/consistent-destructuring
-                            `${request.headers['content-type']}.`,
-                        {},
-                    ),
-                    statusCode: 400,
-                },
-            }
+        default:
     }
 }
killedBy: Should get correct metrics for SimpleMetricsClient
statusReason: Cannot read properties of undefined (reading 'error')

[Killed] ObjectLiteral
src/request/ExtractInformationFromRequest.ts:149:24
             return extractInformationFromUrlParameters(`host?${body}.`)
         default:
             return {
-                error: {
-                    graphQLError: new GraphQLError(
-                        'POST body contains invalid content type: ' +
-                            // eslint-disable-next-line unicorn/consistent-destructuring
-                            `${request.headers['content-type']}.`,
-                        {},
-                    ),
-                    statusCode: 400,
-                },
+                error: {},
             }
     }
killedBy: Should get error response if content type cannot be processed
statusReason: Cannot read properties of undefined (reading 'toJSON')

[Killed] StringLiteral
src/request/ExtractInformationFromRequest.ts:153:29
                     graphQLError: new GraphQLError(
                         'POST body contains invalid content type: ' +
                             // eslint-disable-next-line unicorn/consistent-destructuring
-                            `${request.headers['content-type']}.`,
+                            ``,
                         {},
                     ),
killedBy: Should get error response if content type cannot be processed
statusReason: expected 'POST body contains invalid content ty…' to be 'POST body contains invalid content ty…' // Object.is equality
