[Killed] BlockStatement
src/request/GetContentType.ts:3:67
 import type { ContentType } from '@dreamit/graphql-server-base'
 
-export function getContentType(contentType?: string): ContentType {
-    if (contentType) {
-        if (contentType.includes('application/graphql')) {
-            return 'application/graphql'
-        } else if (contentType.includes('application/json')) {
-            return 'application/json'
-        } else if (contentType.includes('application/x-www-form-urlencoded')) {
-            return 'application/x-www-form-urlencoded'
-        }
-    }
-    return ''
-}
+export function getContentType(contentType?: string): ContentType {}
 
killedBy: Should get data response
statusReason: Cannot read properties of undefined (reading 'users')

[Killed] BlockStatement
src/request/GetContentType.ts:4:22
 import type { ContentType } from '@dreamit/graphql-server-base'
 
 export function getContentType(contentType?: string): ContentType {
-    if (contentType) {
-        if (contentType.includes('application/graphql')) {
-            return 'application/graphql'
-        } else if (contentType.includes('application/json')) {
-            return 'application/json'
-        } else if (contentType.includes('application/x-www-form-urlencoded')) {
-            return 'application/x-www-form-urlencoded'
-        }
-    }
+    if (contentType) {}
     return ''
 }
killedBy: Should get data response
statusReason: Cannot read properties of undefined (reading 'users')

[Killed] ConditionalExpression
src/request/GetContentType.ts:4:9
 import type { ContentType } from '@dreamit/graphql-server-base'
 
 export function getContentType(contentType?: string): ContentType {
-    if (contentType) {
+    if (false) {
         if (contentType.includes('application/graphql')) {
             return 'application/graphql'
killedBy: Should get data response
statusReason: Cannot read properties of undefined (reading 'users')

[Killed] ConditionalExpression
src/request/GetContentType.ts:5:13
 
 export function getContentType(contentType?: string): ContentType {
     if (contentType) {
-        if (contentType.includes('application/graphql')) {
+        if (true) {
             return 'application/graphql'
         } else if (contentType.includes('application/json')) {
killedBy: Should get data response
statusReason: Cannot read properties of undefined (reading 'users')

[Killed] ConditionalExpression
src/request/GetContentType.ts:5:13
 
 export function getContentType(contentType?: string): ContentType {
     if (contentType) {
-        if (contentType.includes('application/graphql')) {
+        if (false) {
             return 'application/graphql'
         } else if (contentType.includes('application/json')) {
killedBy: Should get data response for application graphql request
statusReason: Cannot read properties of undefined (reading 'users')

[Killed] ConditionalExpression
src/request/GetContentType.ts:7:20
     if (contentType) {
         if (contentType.includes('application/graphql')) {
             return 'application/graphql'
-        } else if (contentType.includes('application/json')) {
+        } else if (false) {
             return 'application/json'
         } else if (contentType.includes('application/x-www-form-urlencoded')) {
killedBy: Should get data response
statusReason: Cannot read properties of undefined (reading 'users')

[Killed] ConditionalExpression
src/request/GetContentType.ts:7:20
     if (contentType) {
         if (contentType.includes('application/graphql')) {
             return 'application/graphql'
-        } else if (contentType.includes('application/json')) {
+        } else if (true) {
             return 'application/json'
         } else if (contentType.includes('application/x-www-form-urlencoded')) {
killedBy: Should get error response if content type cannot be processed
statusReason: expected 'POST body contains invalid JSON.' to be 'POST body contains invalid content ty…' // Object.is equality

[Killed] StringLiteral
src/request/GetContentType.ts:8:20
         if (contentType.includes('application/graphql')) {
             return 'application/graphql'
         } else if (contentType.includes('application/json')) {
-            return 'application/json'
+            return ""
         } else if (contentType.includes('application/x-www-form-urlencoded')) {
             return 'application/x-www-form-urlencoded'
killedBy: Should get data response
statusReason: Cannot read properties of undefined (reading 'users')

[Killed] ConditionalExpression
src/request/GetContentType.ts:9:20
             return 'application/graphql'
         } else if (contentType.includes('application/json')) {
             return 'application/json'
-        } else if (contentType.includes('application/x-www-form-urlencoded')) {
+        } else if (false) {
             return 'application/x-www-form-urlencoded'
         }
killedBy: Should get data response when using urlencoded request
statusReason: Cannot read properties of undefined (reading 'users')

[Killed] BlockStatement
src/request/GetContentType.ts:9:79
             return 'application/graphql'
         } else if (contentType.includes('application/json')) {
             return 'application/json'
-        } else if (contentType.includes('application/x-www-form-urlencoded')) {
-            return 'application/x-www-form-urlencoded'
-        }
+        } else if (contentType.includes('application/x-www-form-urlencoded')) {}
     }
     return ''
killedBy: Should get data response when using urlencoded request
statusReason: Cannot read properties of undefined (reading 'users')
