[Killed] BooleanLiteral
src/response/ExtractResponseFormatFromAcceptHeader.ts:12:28
  */
 export function extractResponseFormatFromAcceptHeader(
     acceptHeader: string | undefined,
-    returnJsonAsFallback = true,
+    returnJsonAsFallback = false,
 ): ResponseFormat {
     if (!acceptHeader) {
killedBy: Test that response format is extracted correctly from accept header expects for accept header undefined to extract values correctly
statusReason: expected 'UNSUPPORTED' to be 'JSON' // Object.is equality

[Killed] BlockStatement
src/response/ExtractResponseFormatFromAcceptHeader.ts:13:19
 export function extractResponseFormatFromAcceptHeader(
     acceptHeader: string | undefined,
     returnJsonAsFallback = true,
-): ResponseFormat {
-    if (!acceptHeader) {
-        return returnJsonAsFallback ? 'JSON' : 'UNSUPPORTED'
-    }
-
-    const acceptHeaderLower = acceptHeader.toLowerCase()
-    if (
-        acceptHeaderLower.includes('application/graphql-response+json') &&
-        !acceptHeaderLower.includes('application/graphql-response+json;q=')
-    ) {
-        return 'GRAPHQL-RESPONSE'
-    } else if (acceptHeaderLower.includes('application/json')) {
-        return 'JSON'
-    } else {
-        return returnJsonAsFallback ? 'JSON' : 'UNSUPPORTED'
-    }
-}
+): ResponseFormat {}
 
killedBy: Should correctly handle requests when returnNotAcceptableForUnsupportedResponseFormat is true
statusReason: expected 200 to be 406 // Object.is equality

[Killed] BlockStatement
src/response/ExtractResponseFormatFromAcceptHeader.ts:14:24
     acceptHeader: string | undefined,
     returnJsonAsFallback = true,
 ): ResponseFormat {
-    if (!acceptHeader) {
-        return returnJsonAsFallback ? 'JSON' : 'UNSUPPORTED'
-    }
+    if (!acceptHeader) {}
 
     const acceptHeaderLower = acceptHeader.toLowerCase()
killedBy: Should get data response
statusReason: Cannot read properties of undefined (reading 'toLowerCase')

[Killed] ConditionalExpression
src/response/ExtractResponseFormatFromAcceptHeader.ts:14:9
     acceptHeader: string | undefined,
     returnJsonAsFallback = true,
 ): ResponseFormat {
-    if (!acceptHeader) {
+    if (false) {
         return returnJsonAsFallback ? 'JSON' : 'UNSUPPORTED'
     }
killedBy: Should get data response
statusReason: Cannot read properties of undefined (reading 'toLowerCase')

[Killed] MethodExpression
src/response/ExtractResponseFormatFromAcceptHeader.ts:18:31
         return returnJsonAsFallback ? 'JSON' : 'UNSUPPORTED'
     }
 
-    const acceptHeaderLower = acceptHeader.toLowerCase()
+    const acceptHeaderLower = acceptHeader.toUpperCase()
     if (
         acceptHeaderLower.includes('application/graphql-response+json') &&
killedBy: Test that response format is extracted correctly from accept header expects for accept header 'application/graphql-response+json' to extract values correctly
statusReason: expected 'JSON' to be 'GRAPHQL-RESPONSE' // Object.is equality

[Killed] LogicalOperator
src/response/ExtractResponseFormatFromAcceptHeader.ts:20:9
 
     const acceptHeaderLower = acceptHeader.toLowerCase()
     if (
-        acceptHeaderLower.includes('application/graphql-response+json') &&
-        !acceptHeaderLower.includes('application/graphql-response+json;q=')
+        acceptHeaderLower.includes('application/graphql-response+json') || !acceptHeaderLower.includes('application/graphql-response+json;q=')
     ) {
         return 'GRAPHQL-RESPONSE'
killedBy: Test that response format is extracted correctly from accept header expects for accept header 'somethingStrange' to extract values correctly
statusReason: expected 'GRAPHQL-RESPONSE' to be 'JSON' // Object.is equality

[Killed] ConditionalExpression
src/response/ExtractResponseFormatFromAcceptHeader.ts:20:9
 
     const acceptHeaderLower = acceptHeader.toLowerCase()
     if (
-        acceptHeaderLower.includes('application/graphql-response+json') &&
-        !acceptHeaderLower.includes('application/graphql-response+json;q=')
+        true
     ) {
         return 'GRAPHQL-RESPONSE'
killedBy: Test that response format is extracted correctly from accept header expects for accept header 'somethingStrange' to extract values correctly
statusReason: expected 'GRAPHQL-RESPONSE' to be 'JSON' // Object.is equality

[Killed] BooleanLiteral
src/response/ExtractResponseFormatFromAcceptHeader.ts:21:9
     const acceptHeaderLower = acceptHeader.toLowerCase()
     if (
         acceptHeaderLower.includes('application/graphql-response+json') &&
-        !acceptHeaderLower.includes('application/graphql-response+json;q=')
+        acceptHeaderLower.includes('application/graphql-response+json;q=')
     ) {
         return 'GRAPHQL-RESPONSE'
killedBy: Test that response format is extracted correctly from accept header expects for accept header 'application/graphql-response+json' to extract values correctly
statusReason: expected 'JSON' to be 'GRAPHQL-RESPONSE' // Object.is equality

[Killed] BlockStatement
src/response/ExtractResponseFormatFromAcceptHeader.ts:22:7
     if (
         acceptHeaderLower.includes('application/graphql-response+json') &&
         !acceptHeaderLower.includes('application/graphql-response+json;q=')
-    ) {
-        return 'GRAPHQL-RESPONSE'
-    } else if (acceptHeaderLower.includes('application/json')) {
+    ) {} else if (acceptHeaderLower.includes('application/json')) {
         return 'JSON'
     } else {
killedBy: Test that response format is extracted correctly from accept header expects for accept header 'application/graphql-response+json' to extract values correctly
statusReason: expected undefined to be 'GRAPHQL-RESPONSE' // Object.is equality

[Killed] ConditionalExpression
src/response/ExtractResponseFormatFromAcceptHeader.ts:24:16
         !acceptHeaderLower.includes('application/graphql-response+json;q=')
     ) {
         return 'GRAPHQL-RESPONSE'
-    } else if (acceptHeaderLower.includes('application/json')) {
+    } else if (false) {
         return 'JSON'
     } else {
killedBy: Test that response format is extracted correctly from accept header expects for accept header 'application/json' to extract values correctly
statusReason: expected 'UNSUPPORTED' to be 'JSON' // Object.is equality

[Killed] BlockStatement
src/response/ExtractResponseFormatFromAcceptHeader.ts:24:64
         !acceptHeaderLower.includes('application/graphql-response+json;q=')
     ) {
         return 'GRAPHQL-RESPONSE'
-    } else if (acceptHeaderLower.includes('application/json')) {
-        return 'JSON'
-    } else {
+    } else if (acceptHeaderLower.includes('application/json')) {} else {
         return returnJsonAsFallback ? 'JSON' : 'UNSUPPORTED'
     }
killedBy: Test that response format is extracted correctly from accept header expects for accept header 'application/json' to extract values correctly
statusReason: expected undefined to be 'JSON' // Object.is equality

[Killed] BlockStatement
src/response/ExtractResponseFormatFromAcceptHeader.ts:26:12
         return 'GRAPHQL-RESPONSE'
     } else if (acceptHeaderLower.includes('application/json')) {
         return 'JSON'
-    } else {
-        return returnJsonAsFallback ? 'JSON' : 'UNSUPPORTED'
-    }
+    } else {}
 }
 
killedBy: Test that response format is extracted correctly from accept header expects for accept header 'somethingStrange' to extract values correctly
statusReason: expected undefined to be 'JSON' // Object.is equality

[Killed] StringLiteral
src/response/ExtractResponseFormatFromAcceptHeader.ts:27:39
     } else if (acceptHeaderLower.includes('application/json')) {
         return 'JSON'
     } else {
-        return returnJsonAsFallback ? 'JSON' : 'UNSUPPORTED'
+        return returnJsonAsFallback ? "" : 'UNSUPPORTED'
     }
 }
killedBy: Test that response format is extracted correctly from accept header expects for accept header 'somethingStrange' to extract values correctly
statusReason: expected '' to be 'JSON' // Object.is equality

[Killed] StringLiteral
src/response/ExtractResponseFormatFromAcceptHeader.ts:27:48
     } else if (acceptHeaderLower.includes('application/json')) {
         return 'JSON'
     } else {
-        return returnJsonAsFallback ? 'JSON' : 'UNSUPPORTED'
+        return returnJsonAsFallback ? 'JSON' : ""
     }
 }
killedBy: Test that response format is extracted correctly from accept header expects for accept header 'somethingStrange' to extract values correctly
statusReason: expected '' to be 'UNSUPPORTED' // Object.is equality
