[Killed] BlockStatement
src/response/GraphQLExecutionResult.ts:6:17
 
 export function getFirstErrorFromExecutionResult(
     result: GraphQLExecutionResult,
-): GraphQLError {
-    if (
-        result.executionResult.errors &&
-        result.executionResult.errors.length > 0
-    ) {
-        return result.executionResult.errors[0]
-    }
-    return new GraphQLError('No error found in ExecutionResult!', {})
-}
+): GraphQLError {}
 
killedBy: Should get first error from ExecutionResult
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] ConditionalExpression
src/response/GraphQLExecutionResult.ts:8:9
     result: GraphQLExecutionResult,
 ): GraphQLError {
     if (
-        result.executionResult.errors &&
-        result.executionResult.errors.length > 0
+        true
     ) {
         return result.executionResult.errors[0]
killedBy: Should return error message if no error is available when calling getFirstErrorFromExecutionResult
statusReason: Cannot read properties of undefined (reading '0')

[Killed] LogicalOperator
src/response/GraphQLExecutionResult.ts:8:9
     result: GraphQLExecutionResult,
 ): GraphQLError {
     if (
-        result.executionResult.errors &&
-        result.executionResult.errors.length > 0
+        result.executionResult.errors || result.executionResult.errors.length > 0
     ) {
         return result.executionResult.errors[0]
killedBy: Should return error message if no error is available when calling getFirstErrorFromExecutionResult
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] EqualityOperator
src/response/GraphQLExecutionResult.ts:9:9
 ): GraphQLError {
     if (
         result.executionResult.errors &&
-        result.executionResult.errors.length > 0
+        result.executionResult.errors.length <= 0
     ) {
         return result.executionResult.errors[0]
killedBy: Should get first error from ExecutionResult
statusReason: expected 'No error found in ExecutionResult!' to be 'First error' // Object.is equality

[Killed] EqualityOperator
src/response/GraphQLExecutionResult.ts:9:9
 ): GraphQLError {
     if (
         result.executionResult.errors &&
-        result.executionResult.errors.length > 0
+        result.executionResult.errors.length >= 0
     ) {
         return result.executionResult.errors[0]
killedBy: Should return error message if execution result has an empty error array when calling getFirstErrorFromExecutionResult
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] BlockStatement
src/response/GraphQLExecutionResult.ts:10:7
     if (
         result.executionResult.errors &&
         result.executionResult.errors.length > 0
-    ) {
-        return result.executionResult.errors[0]
-    }
+    ) {}
     return new GraphQLError('No error found in ExecutionResult!', {})
 }
killedBy: Should get first error from ExecutionResult
statusReason: expected 'No error found in ExecutionResult!' to be 'First error' // Object.is equality

[Killed] StringLiteral
src/response/GraphQLExecutionResult.ts:13:29
     ) {
         return result.executionResult.errors[0]
     }
-    return new GraphQLError('No error found in ExecutionResult!', {})
+    return new GraphQLError("", {})
 }
 
killedBy: Should return error message if no error is available when calling getFirstErrorFromExecutionResult
statusReason: expected '' to be 'No error found in ExecutionResult!' // Object.is equality
