[Killed] BlockStatement
src/response/SendResponse.ts:28:9
         context,
     )
 
-    try {
-        const validationErrors = getResponseSchemaValidationErrors(
-            responseStandardSchema,
-            executionResult,
-        )
-        if (validationErrors) {
-            executionResult = {
-                errors: validationErrors.map(
-                    (error) => new GraphQLError(error.message, {}),
-                ),
-            }
-        }
-    } catch (error: unknown) {
+    try {} catch (error: unknown) {
         logger.error(
             'An error occurred while validating the response:',
killedBy: Should log errors if ServerResponse or StandardSchema have no correct implementation
statusReason: expected 'Cannot set content-type header becaus…' to be 'An error occurred while validating th…' // Object.is equality

[Killed] ConditionalExpression
src/response/SendResponse.ts:33:13
             responseStandardSchema,
             executionResult,
         )
-        if (validationErrors) {
+        if (false) {
             executionResult = {
                 errors: validationErrors.map(
killedBy: Should send response validation error if any exist
statusReason: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
src/response/SendResponse.ts:33:31
             responseStandardSchema,
             executionResult,
         )
-        if (validationErrors) {
-            executionResult = {
-                errors: validationErrors.map(
-                    (error) => new GraphQLError(error.message, {}),
-                ),
-            }
-        }
+        if (validationErrors) {}
     } catch (error: unknown) {
         logger.error(
killedBy: Should send response validation error if any exist
statusReason: Cannot read properties of undefined (reading '0')

[Killed] ObjectLiteral
src/response/SendResponse.ts:34:31
             executionResult,
         )
         if (validationErrors) {
-            executionResult = {
-                errors: validationErrors.map(
-                    (error) => new GraphQLError(error.message, {}),
-                ),
-            }
+            executionResult = {}
         }
     } catch (error: unknown) {
killedBy: Should send response validation error if any exist
statusReason: Cannot read properties of undefined (reading '0')

[Killed] ArrowFunction
src/response/SendResponse.ts:36:21
         if (validationErrors) {
             executionResult = {
                 errors: validationErrors.map(
-                    (error) => new GraphQLError(error.message, {}),
+                    () => undefined,
                 ),
             }
killedBy: Should send response validation error if any exist
statusReason: Cannot read properties of null (reading 'message')

[Killed] BlockStatement
src/response/SendResponse.ts:40:30
                 ),
             }
         }
-    } catch (error: unknown) {
-        logger.error(
-            'An error occurred while validating the response:',
-            context,
-            error as TypeError,
-            'ResponseValidationError',
-        )
-    }
+    } catch (error: unknown) {}
 
     if (executionResult.errors) {
killedBy: Should log errors if ServerResponse or StandardSchema have no correct implementation
statusReason: expected 'Cannot set content-type header becaus…' to be 'An error occurred while validating th…' // Object.is equality

[Killed] BlockStatement
src/response/SendResponse.ts:49:33
         )
     }
 
-    if (executionResult.errors) {
-        executionResult.errors.map((element) => formatErrorFunction(element))
-    }
+    if (executionResult.errors) {}
     if (statusCode) {
         response.statusCode = statusCode
killedBy: Should get error response with formatted error results if resolver returns GraphQL error and formatError function is defined
statusReason: expected 'Something went wrong!' to be 'Formatted: Something went wrong!' // Object.is equality

[Killed] ConditionalExpression
src/response/SendResponse.ts:49:9
         )
     }
 
-    if (executionResult.errors) {
+    if (true) {
         executionResult.errors.map((element) => formatErrorFunction(element))
     }
killedBy: Should get data response
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ArrowFunction
src/response/SendResponse.ts:50:36
     }
 
     if (executionResult.errors) {
-        executionResult.errors.map((element) => formatErrorFunction(element))
+        executionResult.errors.map(() => undefined)
     }
     if (statusCode) {
killedBy: Should get error response with formatted error results if resolver returns GraphQL error and formatError function is defined
statusReason: expected 'Something went wrong!' to be 'Formatted: Something went wrong!' // Object.is equality

[Killed] ConditionalExpression
src/response/SendResponse.ts:52:9
     if (executionResult.errors) {
         executionResult.errors.map((element) => formatErrorFunction(element))
     }
-    if (statusCode) {
+    if (false) {
         response.statusCode = statusCode
     }
killedBy: Should send original response if responseStandardSchema returns a Promise
statusReason: expected 400 to be 401 // Object.is equality

[Killed] ConditionalExpression
src/response/SendResponse.ts:52:9
     if (executionResult.errors) {
         executionResult.errors.map((element) => formatErrorFunction(element))
     }
-    if (statusCode) {
+    if (true) {
         response.statusCode = statusCode
     }
killedBy: Should use default response.end behavior if no responseEndChunkFunction if defined
statusReason: expected undefined to be 400 // Object.is equality

[Killed] ConditionalExpression
src/response/SendResponse.ts:57:9
     }
 
     const responseContentType =
-        responseFormat === 'GRAPHQL-RESPONSE'
+        false
             ? 'application/graphql-response+json; charset=utf-8'
             : 'application/json; charset=utf-8'
killedBy: Should correctly handle requests when returnNotAcceptableForUnsupportedResponseFormat is true
statusReason: expected 'application/json; charset=utf-8' to be 'application/graphql-response+json; ch…' // Object.is equality

[Killed] EqualityOperator
src/response/SendResponse.ts:57:9
     }
 
     const responseContentType =
-        responseFormat === 'GRAPHQL-RESPONSE'
+        responseFormat !== 'GRAPHQL-RESPONSE'
             ? 'application/graphql-response+json; charset=utf-8'
             : 'application/json; charset=utf-8'
killedBy: Should correctly handle requests when returnNotAcceptableForUnsupportedResponseFormat is true
statusReason: expected 'application/json; charset=utf-8' to be 'application/graphql-response+json; ch…' // Object.is equality

[Killed] StringLiteral
src/response/SendResponse.ts:59:15
     const responseContentType =
         responseFormat === 'GRAPHQL-RESPONSE'
             ? 'application/graphql-response+json; charset=utf-8'
-            : 'application/json; charset=utf-8'
+            : ""
 
     if (response.setHeader) {
killedBy: Should use default response.end behavior if no responseEndChunkFunction if defined
statusReason: expected '' to be 'application/json; charset=utf-8' // Object.is equality

[Killed] BlockStatement
src/response/SendResponse.ts:61:29
             ? 'application/graphql-response+json; charset=utf-8'
             : 'application/json; charset=utf-8'
 
-    if (response.setHeader) {
-        response.setHeader('Content-Type', responseContentType)
-    } else if (response.header) {
+    if (response.setHeader) {} else if (response.header) {
         response.header('Content-Type', responseContentType)
     } else {
killedBy: Should correctly handle requests when returnNotAcceptableForUnsupportedResponseFormat is true
statusReason: expected undefined to be 'application/graphql-response+json; ch…' // Object.is equality

[Killed] ConditionalExpression
src/response/SendResponse.ts:61:9
             ? 'application/graphql-response+json; charset=utf-8'
             : 'application/json; charset=utf-8'
 
-    if (response.setHeader) {
+    if (true) {
         response.setHeader('Content-Type', responseContentType)
     } else if (response.header) {
killedBy: Should use default response.end behavior if no responseEndChunkFunction if defined
statusReason: response.setHeader is not a function

[Killed] ConditionalExpression
src/response/SendResponse.ts:63:16
 
     if (response.setHeader) {
         response.setHeader('Content-Type', responseContentType)
-    } else if (response.header) {
+    } else if (false) {
         response.header('Content-Type', responseContentType)
     } else {
killedBy: Should use default response.end behavior if no responseEndChunkFunction if defined
statusReason: expected undefined to be 'application/json; charset=utf-8' // Object.is equality

[Killed] ConditionalExpression
src/response/SendResponse.ts:63:16
 
     if (response.setHeader) {
         response.setHeader('Content-Type', responseContentType)
-    } else if (response.header) {
+    } else if (true) {
         response.header('Content-Type', responseContentType)
     } else {
killedBy: Should log errors if ServerResponse or StandardSchema have no correct implementation
statusReason: response.header is not a function

[Killed] BlockStatement
src/response/SendResponse.ts:65:12
         response.setHeader('Content-Type', responseContentType)
     } else if (response.header) {
         response.header('Content-Type', responseContentType)
-    } else {
-        logger.error(
-            'Cannot set content-type header because neither setHeader nor header function is available:',
-            context,
-            new Error('MissingHeaderFunction'),
-            'MissingHeaderFunctionError',
-        )
-    }
+    } else {}
 
     if (customHeaders) {
killedBy: Should log errors if ServerResponse or StandardSchema have no correct implementation
statusReason: expected 'Cannot set custom header because neit…' to be 'Cannot set content-type header becaus…' // Object.is equality

[Killed] ConditionalExpression
src/response/SendResponse.ts:74:9
         )
     }
 
-    if (customHeaders) {
+    if (false) {
         for (const [key, value] of Object.entries(customHeaders)) {
             logger.debug(`Set custom header ${key} to ${value}`, context)
killedBy: Should send original response if responseStandardSchema returns a Promise
statusReason: expected undefined to be 'CustomValue' // Object.is equality

[Killed] BlockStatement
src/response/SendResponse.ts:74:24
         )
     }
 
-    if (customHeaders) {
-        for (const [key, value] of Object.entries(customHeaders)) {
-            logger.debug(`Set custom header ${key} to ${value}`, context)
-
-            if (response.setHeader) {
-                response.setHeader(key, String(value))
-            } else if (response.header) {
-                response.header(key, String(value))
-            } else {
-                logger.error(
-                    'Cannot set custom header because neither setHeader nor header function is available:',
-                    context,
-                    new Error('MissingHeaderFunction'),
-                    'MissingHeaderFunctionError',
-                )
-                // If neither setHeader nor header function is available it does not make sense to continue
-                break
-            }
-        }
-    }
+    if (customHeaders) {}
 
     if (response.end) {
killedBy: Should send original response if responseStandardSchema returns a Promise
statusReason: expected undefined to be 'CustomValue' // Object.is equality

[Killed] BlockStatement
src/response/SendResponse.ts:75:67
     }
 
     if (customHeaders) {
-        for (const [key, value] of Object.entries(customHeaders)) {
-            logger.debug(`Set custom header ${key} to ${value}`, context)
-
-            if (response.setHeader) {
-                response.setHeader(key, String(value))
-            } else if (response.header) {
-                response.header(key, String(value))
-            } else {
-                logger.error(
-                    'Cannot set custom header because neither setHeader nor header function is available:',
-                    context,
-                    new Error('MissingHeaderFunction'),
-                    'MissingHeaderFunctionError',
-                )
-                // If neither setHeader nor header function is available it does not make sense to continue
-                break
-            }
-        }
+        for (const [key, value] of Object.entries(customHeaders)) {}
     }
 
killedBy: Should get error response if invalid method is used
statusReason: expected undefined to be 'GET, POST' // Object.is equality

[Killed] BlockStatement
src/response/SendResponse.ts:78:37
         for (const [key, value] of Object.entries(customHeaders)) {
             logger.debug(`Set custom header ${key} to ${value}`, context)
 
-            if (response.setHeader) {
-                response.setHeader(key, String(value))
-            } else if (response.header) {
+            if (response.setHeader) {} else if (response.header) {
                 response.header(key, String(value))
             } else {
killedBy: Should send original response if responseStandardSchema returns a Promise
statusReason: expected undefined to be 'CustomValue' // Object.is equality

[Killed] BlockStatement
src/response/SendResponse.ts:80:41
 
             if (response.setHeader) {
                 response.setHeader(key, String(value))
-            } else if (response.header) {
-                response.header(key, String(value))
-            } else {
+            } else if (response.header) {} else {
                 logger.error(
                     'Cannot set custom header because neither setHeader nor header function is available:',
killedBy: Should send original response if responseStandardSchema returns a Promise
statusReason: expected undefined to be 'CustomValue' // Object.is equality

[Killed] ConditionalExpression
src/response/SendResponse.ts:80:24
 
             if (response.setHeader) {
                 response.setHeader(key, String(value))
-            } else if (response.header) {
+            } else if (false) {
                 response.header(key, String(value))
             } else {
killedBy: Should send original response if responseStandardSchema returns a Promise
statusReason: expected undefined to be 'CustomValue' // Object.is equality

[Killed] BlockStatement
src/response/SendResponse.ts:82:20
                 response.setHeader(key, String(value))
             } else if (response.header) {
                 response.header(key, String(value))
-            } else {
-                logger.error(
-                    'Cannot set custom header because neither setHeader nor header function is available:',
-                    context,
-                    new Error('MissingHeaderFunction'),
-                    'MissingHeaderFunctionError',
-                )
-                // If neither setHeader nor header function is available it does not make sense to continue
-                break
-            }
+            } else {}
         }
     }
killedBy: Should log errors if ServerResponse or StandardSchema have no correct implementation
statusReason: expected 'Cannot send response because neither …' to be 'Cannot set custom header because neit…' // Object.is equality

[Killed] ConditionalExpression
src/response/SendResponse.ts:95:9
         }
     }
 
-    if (response.end) {
+    if (true) {
         response.end(responseEndChunkFunction(executionResult))
     } else if (response.send) {
killedBy: Should use default response.end behavior if no responseEndChunkFunction if defined
statusReason: response.end is not a function

[Killed] BlockStatement
src/response/SendResponse.ts:95:23
         }
     }
 
-    if (response.end) {
-        response.end(responseEndChunkFunction(executionResult))
-    } else if (response.send) {
+    if (response.end) {} else if (response.send) {
         response.send(responseEndChunkFunction(executionResult))
     } else {
killedBy: Should use default response.end behavior if no responseEndChunkFunction if defined
statusReason: Cannot read properties of undefined (reading 'data')

[Killed] ConditionalExpression
src/response/SendResponse.ts:97:16
 
     if (response.end) {
         response.end(responseEndChunkFunction(executionResult))
-    } else if (response.send) {
+    } else if (true) {
         response.send(responseEndChunkFunction(executionResult))
     } else {
killedBy: Should log errors if ServerResponse or StandardSchema have no correct implementation
statusReason: response.send is not a function

[Killed] BlockStatement
src/response/SendResponse.ts:97:31
 
     if (response.end) {
         response.end(responseEndChunkFunction(executionResult))
-    } else if (response.send) {
-        response.send(responseEndChunkFunction(executionResult))
-    } else {
+    } else if (response.send) {} else {
         logger.error(
             'Cannot send response because neither end nor send function is available:',
killedBy: Should use default response.end behavior if no responseEndChunkFunction if defined
statusReason: Cannot read properties of undefined (reading 'data')

[Killed] BlockStatement
src/response/SendResponse.ts:99:12
         response.end(responseEndChunkFunction(executionResult))
     } else if (response.send) {
         response.send(responseEndChunkFunction(executionResult))
-    } else {
-        logger.error(
-            'Cannot send response because neither end nor send function is available:',
-            context,
-            new Error('MissingSendFunction'),
-            'MissingSendFunctionError',
-        )
-    }
+    } else {}
 }
 
killedBy: Should log errors if ServerResponse or StandardSchema have no correct implementation
statusReason: expected undefined to be 'Cannot send response because neither …' // Object.is equality
