[Killed] BlockStatement
src/server/DefaultGraphQLServerOptions.ts:97:26
  */
 function defaultFormatErrorFunction(
     error: GraphQLError,
-): GraphQLFormattedError {
-    return error.toJSON()
-}
+): GraphQLFormattedError {}
 
 /**
killedBy: defaultFormatErrorFunction should return the expected formatted error
statusReason: expected undefined to strictly equal { message: 'An error' }

[Killed] BlockStatement
src/server/DefaultGraphQLServerOptions.ts:110:29
     serverOptions: GraphQLServerOptions
     request?: GraphQLServerRequest
     response?: GraphQLServerResponse
-}): Record<string, unknown> {
-    const { serverOptions, request, response } = contextParameters
-    const logger = serverOptions.logger
-    logger.debug(
-        'Calling defaultRequestResponseContextFunction with ' +
-            `request ${request} and response ${response}`,
-        {},
-    )
-    return {}
-}
+}): Record<string, unknown> {}
 
 /**
killedBy: Should get data response
statusReason: Cannot set properties of undefined (setting 'query')

[Killed] BlockStatement
src/server/DefaultGraphQLServerOptions.ts:133:41
     executionResult: ExecutionResult
     serverOptions: GraphQLServerOptions
     context: Record<string, unknown>
-}): Record<string, unknown> | undefined {
-    const { requestInformation, executionResult, serverOptions, context } =
-        extensionParameters
-    const logger = serverOptions.logger
-    logger.debug(
-        `Calling defaultExtensions for requestInfo ${JSON.stringify(requestInformation)}` +
-            ` and executionResult ${JSON.stringify(executionResult)}`,
-        context,
-    )
-    return undefined
-}
+}): Record<string, unknown> | undefined {}
 
 /**
killedBy: defaultExtensions should return undefined
statusReason: expected undefined to be 'Calling defaultExtensions for request…' // Object.is equality

[Killed] BlockStatement
src/server/DefaultGraphQLServerOptions.ts:154:10
     error: unknown
     serverOptions: GraphQLServerOptions
     context: Record<string, unknown>
-}): void {
-    const { errorName, error, serverOptions, context } = errorParameters
-    const { logger, metricsClient } = serverOptions
-    logger.debug(
-        `Calling defaultCollectErrorMetrics with error ${error} and errorName ${errorName}`,
-        context,
-    )
-    metricsClient.increaseErrors(errorName, context)
-}
+}): void {}
 
 /**
killedBy: Should get correct metrics for SimpleMetricsClient
statusReason: expected '\n            # HELP graphql_server_r…' to contain 'graphql_server_errors{errorClass="Sch…'

[Killed] BlockStatement
src/server/DefaultGraphQLServerOptions.ts:170:69
  * @param {GraphQLSchema} schema - The new schema to use as updated schema.
  * @returns {boolean} True if schema should be updated, false if not
  */
-function defaultShouldUpdateSchema(schema?: GraphQLSchema): boolean {
-    return !!schema
-}
+function defaultShouldUpdateSchema(schema?: GraphQLSchema): boolean {}
 
 /**
killedBy: Should create schema on GraphQLServer class creation
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/server/DefaultGraphQLServerOptions.ts:171:12
  * @returns {boolean} True if schema should be updated, false if not
  */
 function defaultShouldUpdateSchema(schema?: GraphQLSchema): boolean {
-    return !!schema
+    return !schema
 }
 
killedBy: Should get correct metrics for SimpleMetricsClient
statusReason: expected '\n            # HELP graphql_server_r…' to contain 'graphql_server_availability 1'

[Killed] BlockStatement
src/server/DefaultGraphQLServerOptions.ts:181:27
  */
 function defaultMethodNotAllowedResponse(
     method?: string,
-): GraphQLExecutionResult {
-    return {
-        customHeaders: { allow: 'GET, POST' },
-        executionResult: {
-            errors: [
-                new GraphQLError(
-                    'GraphQL server only supports GET and POST requests.' +
-                        ` Got ${method}`,
-                    {},
-                ),
-            ],
-        },
-        statusCode: 405,
-    }
-}
+): GraphQLExecutionResult {}
 
 /**
killedBy: Should get error response if invalid method is used
statusReason: Cannot read properties of undefined (reading 'executionResult')

[Killed] ArrayDeclaration
src/server/DefaultGraphQLServerOptions.ts:185:21
     return {
         customHeaders: { allow: 'GET, POST' },
         executionResult: {
-            errors: [
-                new GraphQLError(
-                    'GraphQL server only supports GET and POST requests.' +
-                        ` Got ${method}`,
-                    {},
-                ),
-            ],
+            errors: [],
         },
         statusCode: 405,
killedBy: Should get error response if invalid method is used
statusReason: expected 'GraphQL response contains empty "erro…' to be 'GraphQL server only supports GET and …' // Object.is equality

[Killed] StringLiteral
src/server/DefaultGraphQLServerOptions.ts:187:21
         executionResult: {
             errors: [
                 new GraphQLError(
-                    'GraphQL server only supports GET and POST requests.' +
+                    "" +
                         ` Got ${method}`,
                     {},
killedBy: Should get error response if invalid method is used
statusReason: expected ' Got PUT' to be 'GraphQL server only supports GET and …' // Object.is equality

[Killed] BlockStatement
src/server/DefaultGraphQLServerOptions.ts:204:27
  */
 function defaultMissingQueryParameterResponse(
     method?: string,
-): GraphQLExecutionResult {
-    return {
-        executionResult: {
-            errors: [
-                new GraphQLError(
-                    'Request cannot be processed. No query was found ' +
-                        `in parameters or body. Used method is ${method}`,
-                    {},
-                ),
-            ],
-        },
-        statusCode: 400,
-    }
-}
+): GraphQLExecutionResult {}
 
 /**
killedBy: Should get error response if body does not contain query information
statusReason: Cannot read properties of undefined (reading 'executionResult')

[Killed] StringLiteral
src/server/DefaultGraphQLServerOptions.ts:210:25
             errors: [
                 new GraphQLError(
                     'Request cannot be processed. No query was found ' +
-                        `in parameters or body. Used method is ${method}`,
+                        ``,
                     {},
                 ),
killedBy: Should get error response if body does not contain query information
statusReason: expected 'Request cannot be processed. No query…' to be 'Request cannot be processed. No query…' // Object.is equality

[Killed] BlockStatement
src/server/DefaultGraphQLServerOptions.ts:227:27
  */
 function defaultOnlyQueryInGetRequestsResponse(
     operation?: string,
-): GraphQLExecutionResult {
-    return {
-        customHeaders: { allow: 'POST' },
-        executionResult: {
-            errors: [
-                new GraphQLError(
-                    'Only "query" operation is allowed in "GET" requests.' +
-                        ` Got: "${operation}"`,
-                    {},
-                ),
-            ],
-        },
-        statusCode: 405,
-    }
-}
+): GraphQLExecutionResult {}
 
 /**
killedBy: Should get error response when using mutation in a GET request
statusReason: Cannot read properties of undefined (reading 'executionResult')

[Killed] StringLiteral
src/server/DefaultGraphQLServerOptions.ts:229:33
     operation?: string,
 ): GraphQLExecutionResult {
     return {
-        customHeaders: { allow: 'POST' },
+        customHeaders: { allow: "" },
         executionResult: {
             errors: [
killedBy: defaultOnlyQueryInGetRequestsResponse should return the expected execution result
statusReason: expected { customHeaders: { allow: '' }, …(2) } to strictly equal { …(3) }

[Killed] BlockStatement
src/server/DefaultGraphQLServerOptions.ts:250:12
  */
 function defaultResponseEndChunkFunction(
     executionResult: ExecutionResult | undefined,
-): unknown {
-    return JSON.stringify(executionResult)
-}
+): unknown {}
 
 export {
killedBy: Should use default response.end behavior if no responseEndChunkFunction if defined
statusReason: Cannot read properties of undefined (reading 'data')
