[Killed] LogicalOperator
src/server/GetRequestInformation.ts:25:9
     } = options
 
     // Reject requests that do not use GET and POST methods.
-    if (request.method !== 'GET' && request.method !== 'POST') {
+    if (request.method !== 'GET' || request.method !== 'POST') {
         const response = methodNotAllowedResponse(request.method)
         const error = getFirstErrorFromExecutionResult(response)
killedBy: Should get data response
statusReason: Cannot read properties of undefined (reading 'users')

[Killed] ConditionalExpression
src/server/GetRequestInformation.ts:25:37
     } = options
 
     // Reject requests that do not use GET and POST methods.
-    if (request.method !== 'GET' && request.method !== 'POST') {
+    if (request.method !== 'GET' && true) {
         const response = methodNotAllowedResponse(request.method)
         const error = getFirstErrorFromExecutionResult(response)
killedBy: Should get data response
statusReason: Cannot read properties of undefined (reading 'users')
