[Killed] BlockStatement
src/server/GraphQLServer.ts:40:67
     options: GraphQLServerOptions = defaultGraphQLServerOptions
     schemaValidationErrors: readonly GraphQLError[] = []
 
-    constructor(optionsParameter?: Partial<GraphQLServerOptions>) {
-        this.setOptions(optionsParameter)
-    }
+    constructor(optionsParameter?: Partial<GraphQLServerOptions>) {}
 
     setOptions(newOptions?: Partial<GraphQLServerOptions>): void {
killedBy: Should create schema on GraphQLServer class creation
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/server/GraphQLServer.ts:44:66
         this.setOptions(optionsParameter)
     }
 
-    setOptions(newOptions?: Partial<GraphQLServerOptions>): void {
-        this.options = { ...defaultGraphQLServerOptions, ...newOptions }
-        this.setMetricsClient(
-            newOptions?.metricsClient ?? new SimpleMetricsClient(),
-        )
-        this.setSchema(newOptions?.schema)
-    }
+    setOptions(newOptions?: Partial<GraphQLServerOptions>): void {}
 
     /**
killedBy: Should get unfiltered error response if a validation error occurs and removeValidationRecommendations is enabled
statusReason: expected 'Cannot query field "userIdABC" on typ…' to be 'Cannot query field "userIdABC" on typ…' // Object.is equality

[Killed] ObjectLiteral
src/server/GraphQLServer.ts:45:24
     }
 
     setOptions(newOptions?: Partial<GraphQLServerOptions>): void {
-        this.options = { ...defaultGraphQLServerOptions, ...newOptions }
+        this.options = {}
         this.setMetricsClient(
             newOptions?.metricsClient ?? new SimpleMetricsClient(),
killedBy: Should get unfiltered error response if a validation error occurs and removeValidationRecommendations is enabled
statusReason: contextFunction is not a function

[Killed] OptionalChaining
src/server/GraphQLServer.ts:47:13
     setOptions(newOptions?: Partial<GraphQLServerOptions>): void {
         this.options = { ...defaultGraphQLServerOptions, ...newOptions }
         this.setMetricsClient(
-            newOptions?.metricsClient ?? new SimpleMetricsClient(),
+            newOptions.metricsClient ?? new SimpleMetricsClient(),
         )
         this.setSchema(newOptions?.schema)
killedBy: Should set only default options if no options are provided
statusReason: Cannot read properties of undefined (reading 'metricsClient')

[Killed] LogicalOperator
src/server/GraphQLServer.ts:47:13
     setOptions(newOptions?: Partial<GraphQLServerOptions>): void {
         this.options = { ...defaultGraphQLServerOptions, ...newOptions }
         this.setMetricsClient(
-            newOptions?.metricsClient ?? new SimpleMetricsClient(),
+            newOptions?.metricsClient && new SimpleMetricsClient(),
         )
         this.setSchema(newOptions?.schema)
killedBy: Should get unfiltered error response if a validation error occurs and removeValidationRecommendations is enabled
statusReason: Cannot read properties of undefined (reading 'setAvailability')

[Killed] OptionalChaining
src/server/GraphQLServer.ts:49:24
         this.setMetricsClient(
             newOptions?.metricsClient ?? new SimpleMetricsClient(),
         )
-        this.setSchema(newOptions?.schema)
+        this.setSchema(newOptions.schema)
     }
 
killedBy: Should set only default options if no options are provided
statusReason: Cannot read properties of undefined (reading 'schema')

[Killed] BlockStatement
src/server/GraphQLServer.ts:56:58
      * Sets a metrics client for to be used in the GraphQLServer.
      * @param {MetricsClient} metricsClient - The metrics client to use in the GraphQLServer
      */
-    setMetricsClient(metricsClient: MetricsClient): void {
-        this.options.metricsClient = metricsClient
-        this.options.metricsClient.setAvailability(
-            this.isValidSchema(this.options.schema) ? 1 : 0,
-        )
-    }
+    setMetricsClient(metricsClient: MetricsClient): void {}
 
     getSchema(): GraphQLSchema | undefined {
killedBy: Should get correct metrics for SimpleMetricsClient
statusReason: expected '' to be 'text/plain; charset=utf-8; version=0.…' // Object.is equality

[Killed] BlockStatement
src/server/GraphQLServer.ts:63:44
         )
     }
 
-    getSchema(): GraphQLSchema | undefined {
-        return this.options.schema
-    }
+    getSchema(): GraphQLSchema | undefined {}
 
     isValidSchema(schema?: GraphQLSchema): boolean {
killedBy: Should create schema on GraphQLServer class creation
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/server/GraphQLServer.ts:67:52
         return this.options.schema
     }
 
-    isValidSchema(schema?: GraphQLSchema): boolean {
-        return schema ? this.schemaValidationErrors.length === 0 : false
-    }
+    isValidSchema(schema?: GraphQLSchema): boolean {}
 
     setSchema(schema?: GraphQLSchema): void {
killedBy: Should execute query without server
statusReason: expected undefined to deeply equal [ { userId: '1', …(1) }, …(1) ]

[Killed] ConditionalExpression
src/server/GraphQLServer.ts:68:25
     }
 
     isValidSchema(schema?: GraphQLSchema): boolean {
-        return schema ? this.schemaValidationErrors.length === 0 : false
+        return schema ? false : false
     }
 
killedBy: Should get data response
statusReason: Cannot read properties of undefined (reading 'users')

[Killed] ConditionalExpression
src/server/GraphQLServer.ts:68:25
     }
 
     isValidSchema(schema?: GraphQLSchema): boolean {
-        return schema ? this.schemaValidationErrors.length === 0 : false
+        return schema ? true : false
     }
 
killedBy: Should get correct metrics for SimpleMetricsClient
statusReason: expected '\n            # HELP graphql_server_r…' to contain 'graphql_server_availability 0'

[Killed] ObjectLiteral
src/server/GraphQLServer.ts:73:41
 
     setSchema(schema?: GraphQLSchema): void {
         const { contextFunction, logger } = this.options
-        const context = contextFunction({ serverOptions: this.options })
+        const context = contextFunction({})
 
         logger.info('Trying to set graphql schema', context)
killedBy: Should get unfiltered error response if a validation error occurs and removeValidationRecommendations is enabled
statusReason: Cannot read properties of undefined (reading 'logger')

[Killed] ConditionalExpression
src/server/GraphQLServer.ts:77:13
 
         logger.info('Trying to set graphql schema', context)
         logger.debug(`Schema is ${JSON.stringify(schema)}`, context)
-        if (this.options.shouldUpdateSchemaFunction(schema)) {
+        if (false) {
             this.options.schema = schema
             // Validate schema
killedBy: Should get error response when GraphQL context error occurs when calling execute function
statusReason: expected undefined to be 'query users{ users { userId userName …' // Object.is equality

[Killed] ConditionalExpression
src/server/GraphQLServer.ts:77:13
 
         logger.info('Trying to set graphql schema', context)
         logger.debug(`Schema is ${JSON.stringify(schema)}`, context)
-        if (this.options.shouldUpdateSchemaFunction(schema)) {
+        if (true) {
             this.options.schema = schema
             // Validate schema
killedBy: Should not update schema when given schema is undefined
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/server/GraphQLServer.ts:80:17
         if (this.options.shouldUpdateSchemaFunction(schema)) {
             this.options.schema = schema
             // Validate schema
-            if (this.options.schema) {
+            if (true) {
                 this.schemaValidationErrors =
                     this.options.schemaValidationFunction(this.options.schema)
killedBy: Should update schema when given schema is undefined and shouldUpdateSchemaFunction is true
statusReason: Expected undefined to be a GraphQL schema.

[Killed] ConditionalExpression
src/server/GraphQLServer.ts:80:17
         if (this.options.shouldUpdateSchemaFunction(schema)) {
             this.options.schema = schema
             // Validate schema
-            if (this.options.schema) {
+            if (false) {
                 this.schemaValidationErrors =
                     this.options.schemaValidationFunction(this.options.schema)
killedBy: Should get error response if invalid schema is used
statusReason: expected 'POST body contains invalid JSON.' to be 'Request cannot be processed. Schema i…' // Object.is equality

[Killed] ConditionalExpression
src/server/GraphQLServer.ts:83:21
             if (this.options.schema) {
                 this.schemaValidationErrors =
                     this.options.schemaValidationFunction(this.options.schema)
-                if (this.schemaValidationErrors.length > 0) {
+                if (false) {
                     logger.warn(
                         'Schema validation failed with errors. Please check the GraphQL schema and fix potential issues.',
killedBy: Should get correct metrics for SimpleMetricsClient
statusReason: expected '\n            # HELP graphql_server_r…' to contain 'graphql_server_errors{errorClass="Sch…'

[Killed] EqualityOperator
src/server/GraphQLServer.ts:83:21
             if (this.options.schema) {
                 this.schemaValidationErrors =
                     this.options.schemaValidationFunction(this.options.schema)
-                if (this.schemaValidationErrors.length > 0) {
+                if (this.schemaValidationErrors.length >= 0) {
                     logger.warn(
                         'Schema validation failed with errors. Please check the GraphQL schema and fix potential issues.',
killedBy: Should get error response when GraphQL context error occurs when calling execute function
statusReason: expected undefined to be 'query users{ users { userId userName …' // Object.is equality

[Killed] BlockStatement
src/server/GraphQLServer.ts:88:70
                         'Schema validation failed with errors. Please check the GraphQL schema and fix potential issues.',
                         context,
                     )
-                    for (const error of this.schemaValidationErrors) {
-                        logger.error(
-                            'A schema validation error occurred: ',
-                            context,
-                            error,
-                            SCHEMA_VALIDATION_ERROR,
-                        )
-                        this.options.collectErrorMetricsFunction({
-                            context,
-                            error,
-                            errorName: SCHEMA_VALIDATION_ERROR,
-                            serverOptions: this.options,
-                        })
-                    }
+                    for (const error of this.schemaValidationErrors) {}
                 }
             }
killedBy: Should get correct metrics for SimpleMetricsClient
statusReason: expected '\n            # HELP graphql_server_r…' to contain 'graphql_server_errors{errorClass="Sch…'

[Killed] ObjectLiteral
src/server/GraphQLServer.ts:95:66
                             error,
                             SCHEMA_VALIDATION_ERROR,
                         )
-                        this.options.collectErrorMetricsFunction({
-                            context,
-                            error,
-                            errorName: SCHEMA_VALIDATION_ERROR,
-                            serverOptions: this.options,
-                        })
+                        this.options.collectErrorMetricsFunction({})
                     }
                 }
killedBy: Should get error response if invalid schema is used
statusReason: Cannot destructure property 'logger' of 'serverOptions' as it is undefined.

[Killed] BlockStatement
src/server/GraphQLServer.ts:104:16
                     }
                 }
             }
-        } else {
-            logger.warn(
-                'Schema update was rejected because condition set in "shouldUpdateSchema" check was not fulfilled.',
-                context,
-            )
-        }
+        } else {}
         this.options.metricsClient.setAvailability(
             this.isValidSchema(this.options.schema) ? 1 : 0,
killedBy: Should not update schema when given schema is undefined
statusReason: expected 'Trying to set graphql schema' to be 'Schema update was rejected because co…' // Object.is equality

[Killed] BlockStatement
src/server/GraphQLServer.ts:115:74
         )
     }
 
-    getSchemaValidationErrors(): ReadonlyArray<GraphQLError> | undefined {
-        return this.schemaValidationErrors
-    }
+    getSchemaValidationErrors(): ReadonlyArray<GraphQLError> | undefined {}
 
     // Gets the Content-Type of the metrics for use in the response headers
killedBy: Should create schema on GraphQLServer class creation
statusReason: expected undefined to be 1 // Object.is equality

[Killed] BlockStatement
src/server/GraphQLServer.ts:120:37
     }
 
     // Gets the Content-Type of the metrics for use in the response headers
-    getMetricsContentType(): string {
-        return this.options.metricsClient.getMetricsContentType()
-    }
+    getMetricsContentType(): string {}
 
     // Gets the metrics for use in the response body.
killedBy: Should get correct metrics for SimpleMetricsClient
statusReason: expected undefined to be 'text/plain; charset=utf-8; version=0.…' // Object.is equality

[Killed] BlockStatement
src/server/GraphQLServer.ts:125:41
     }
 
     // Gets the metrics for use in the response body.
-    async getMetrics(): Promise<string> {
-        return await this.options.metricsClient.getMetrics()
-    }
+    async getMetrics(): Promise<string> {}
 
     /**
killedBy: Should get correct metrics for SimpleMetricsClient
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Survived] StringLiteral
src/server/GraphQLServer.ts:159:46
         })
         metricsClient.increaseRequestThroughput(context)
 
-        let responseFormat: ResponseFormat = 'JSON'
+        let responseFormat: ResponseFormat = ""
         // Check request accept header to identify what response format to use
         if (isGraphQLServerRequest(request)) {

[Killed] ConditionalExpression
src/server/GraphQLServer.ts:161:13
 
         let responseFormat: ResponseFormat = 'JSON'
         // Check request accept header to identify what response format to use
-        if (isGraphQLServerRequest(request)) {
+        if (true) {
             const acceptHeader = request.headers['accept']
             // Second condition is negated as JSON should not be returned if returnNotAcceptableForUnsupportedResponseFormat is true
killedBy: Should get data response in GraphQLServerResponse when using GraphQLRequestInfo
statusReason: Cannot read properties of undefined (reading 'accept')

[Killed] ConditionalExpression
src/server/GraphQLServer.ts:161:13
 
         let responseFormat: ResponseFormat = 'JSON'
         // Check request accept header to identify what response format to use
-        if (isGraphQLServerRequest(request)) {
+        if (false) {
             const acceptHeader = request.headers['accept']
             // Second condition is negated as JSON should not be returned if returnNotAcceptableForUnsupportedResponseFormat is true
killedBy: Should correctly handle requests when returnNotAcceptableForUnsupportedResponseFormat is true
statusReason: expected 200 to be 406 // Object.is equality

[Killed] BooleanLiteral
src/server/GraphQLServer.ts:166:17
             // Second condition is negated as JSON should not be returned if returnNotAcceptableForUnsupportedResponseFormat is true
             responseFormat = extractResponseFormatFromAcceptHeader(
                 acceptHeader,
-                !returnNotAcceptableForUnsupportedResponseFormat,
+                returnNotAcceptableForUnsupportedResponseFormat,
             )
             if (
killedBy: Should correctly handle requests when returnNotAcceptableForUnsupportedResponseFormat is true
statusReason: expected 200 to be 406 // Object.is equality

[Killed] ConditionalExpression
src/server/GraphQLServer.ts:169:17
                 !returnNotAcceptableForUnsupportedResponseFormat,
             )
             if (
-                returnNotAcceptableForUnsupportedResponseFormat &&
-                responseFormat === 'UNSUPPORTED'
+                true
             ) {
                 const errorMessage = `Request has unsupported response format in Accept header: ${acceptHeader}. Supported formats are: 'application/graphql-response+json', 'application/json'.`
killedBy: Should get data response
statusReason: Cannot read properties of undefined (reading 'users')

[Killed] ConditionalExpression
src/server/GraphQLServer.ts:169:17
                 !returnNotAcceptableForUnsupportedResponseFormat,
             )
             if (
-                returnNotAcceptableForUnsupportedResponseFormat &&
-                responseFormat === 'UNSUPPORTED'
+                false
             ) {
                 const errorMessage = `Request has unsupported response format in Accept header: ${acceptHeader}. Supported formats are: 'application/graphql-response+json', 'application/json'.`
killedBy: Should correctly handle requests when returnNotAcceptableForUnsupportedResponseFormat is true
statusReason: expected 200 to be 406 // Object.is equality

[Killed] EqualityOperator
src/server/GraphQLServer.ts:170:17
             )
             if (
                 returnNotAcceptableForUnsupportedResponseFormat &&
-                responseFormat === 'UNSUPPORTED'
+                responseFormat !== 'UNSUPPORTED'
             ) {
                 const errorMessage = `Request has unsupported response format in Accept header: ${acceptHeader}. Supported formats are: 'application/graphql-response+json', 'application/json'.`
killedBy: Should correctly handle requests when returnNotAcceptableForUnsupportedResponseFormat is true
statusReason: expected 200 to be 406 // Object.is equality

[Killed] ConditionalExpression
src/server/GraphQLServer.ts:170:17
             )
             if (
                 returnNotAcceptableForUnsupportedResponseFormat &&
-                responseFormat === 'UNSUPPORTED'
+                true
             ) {
                 const errorMessage = `Request has unsupported response format in Accept header: ${acceptHeader}. Supported formats are: 'application/graphql-response+json', 'application/json'.`
killedBy: Should correctly handle requests when returnNotAcceptableForUnsupportedResponseFormat is true
statusReason: expected 406 to be 200 // Object.is equality

[Killed] StringLiteral
src/server/GraphQLServer.ts:172:38
                 returnNotAcceptableForUnsupportedResponseFormat &&
                 responseFormat === 'UNSUPPORTED'
             ) {
-                const errorMessage = `Request has unsupported response format in Accept header: ${acceptHeader}. Supported formats are: 'application/graphql-response+json', 'application/json'.`
+                const errorMessage = ``
                 const error = new GraphQLError(errorMessage, {})
                 logger.error(
killedBy: Should correctly handle requests when returnNotAcceptableForUnsupportedResponseFormat is true
statusReason: expected '' to contain 'Request has unsupported response form…'

[Killed] ObjectLiteral
src/server/GraphQLServer.ts:180:56
                     error,
                     'NOT_ACCEPTABLE_ERROR',
                 )
-                const result: GraphQLExecutionResult = {
-                    customHeaders: {
-                        accept: 'application/graphql-response+json, application/json',
-                    },
-                    executionResult: {
-                        errors: [error],
-                    },
-                    statusCode: 406,
-                }
+                const result: GraphQLExecutionResult = {}
                 if (response && isGraphQLServerRequest(request)) {
                     sendResponse({
killedBy: Should correctly handle requests when returnNotAcceptableForUnsupportedResponseFormat is true
statusReason: Cannot read properties of undefined (reading 'errors')

[Killed] BlockStatement
src/server/GraphQLServer.ts:189:66
                     },
                     statusCode: 406,
                 }
-                if (response && isGraphQLServerRequest(request)) {
-                    sendResponse({
-                        context,
-                        customHeaders: result.customHeaders,
-                        executionResult: result.executionResult,
-                        formatErrorFunction,
-                        logger,
-                        request,
-                        response,
-                        responseEndChunkFunction,
-                        responseFormat,
-                        responseStandardSchema,
-                        statusCode: result.statusCode,
-                    })
-                }
+                if (response && isGraphQLServerRequest(request)) {}
                 return result
             }
killedBy: Should correctly handle requests when returnNotAcceptableForUnsupportedResponseFormat is true
statusReason: expected 400 to be 406 // Object.is equality

[Killed] ConditionalExpression
src/server/GraphQLServer.ts:189:21
                     },
                     statusCode: 406,
                 }
-                if (response && isGraphQLServerRequest(request)) {
+                if (false) {
                     sendResponse({
                         context,
killedBy: Should correctly handle requests when returnNotAcceptableForUnsupportedResponseFormat is true
statusReason: expected 400 to be 406 // Object.is equality

[Killed] ObjectLiteral
src/server/GraphQLServer.ts:190:34
                     statusCode: 406,
                 }
                 if (response && isGraphQLServerRequest(request)) {
-                    sendResponse({
-                        context,
-                        customHeaders: result.customHeaders,
-                        executionResult: result.executionResult,
-                        formatErrorFunction,
-                        logger,
-                        request,
-                        response,
-                        responseEndChunkFunction,
-                        responseFormat,
-                        responseStandardSchema,
-                        statusCode: result.statusCode,
-                    })
+                    sendResponse({})
                 }
                 return result
killedBy: Should correctly handle requests when returnNotAcceptableForUnsupportedResponseFormat is true
statusReason: Cannot read properties of undefined (reading 'debug')

[Killed] BlockStatement
src/server/GraphQLServer.ts:211:44
         const requestInformation = isGraphQLServerRequest(request)
             ? await getRequestInformation(request, context, this.options)
             : request
-        if ('query' in requestInformation) {
-            context.query = requestInformation.query
-        }
+        if ('query' in requestInformation) {}
         if (
             isGraphQLServerRequest(request) &&
killedBy: Should get error response when GraphQL context error occurs when calling execute function
statusReason: expected undefined to be 'query users{ users { userId userName …' // Object.is equality

[Killed] ConditionalExpression
src/server/GraphQLServer.ts:211:13
         const requestInformation = isGraphQLServerRequest(request)
             ? await getRequestInformation(request, context, this.options)
             : request
-        if ('query' in requestInformation) {
+        if (false) {
             context.query = requestInformation.query
         }
killedBy: Should get error response when GraphQL context error occurs when calling execute function
statusReason: expected undefined to be 'query users{ users { userId userName …' // Object.is equality

[Killed] LogicalOperator
src/server/GraphQLServer.ts:215:13
             context.query = requestInformation.query
         }
         if (
-            isGraphQLServerRequest(request) &&
-            'executionResult' in requestInformation
+            isGraphQLServerRequest(request) || 'executionResult' in requestInformation
         ) {
             let result: GraphQLExecutionResult = {
killedBy: Should get data response
statusReason: Cannot read properties of undefined (reading 'errors')

[Killed] ConditionalExpression
src/server/GraphQLServer.ts:215:13
             context.query = requestInformation.query
         }
         if (
-            isGraphQLServerRequest(request) &&
-            'executionResult' in requestInformation
+            true
         ) {
             let result: GraphQLExecutionResult = {
killedBy: Should get data response
statusReason: Cannot read properties of undefined (reading 'errors')

[Killed] BlockStatement
src/server/GraphQLServer.ts:224:47
                 statusCode: requestInformation.statusCode,
             }
 
-            if (adjustGraphQLExecutionResult) {
-                result = adjustGraphQLExecutionResult({
-                    context,
-                    executionResult: result,
-                    formatErrorFunction,
-                    logger,
-                    request: request,
-                })
-            }
+            if (adjustGraphQLExecutionResult) {}
 
             if (response && isGraphQLServerRequest(request)) {
killedBy: Should adjust error response if adjustGraphQLExecutionResult is provided
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] ConditionalExpression
src/server/GraphQLServer.ts:224:17
                 statusCode: requestInformation.statusCode,
             }
 
-            if (adjustGraphQLExecutionResult) {
+            if (false) {
                 result = adjustGraphQLExecutionResult({
                     context,
killedBy: Should adjust error response if adjustGraphQLExecutionResult is provided
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] ConditionalExpression
src/server/GraphQLServer.ts:234:17
                 })
             }
 
-            if (response && isGraphQLServerRequest(request)) {
+            if (false) {
                 sendResponse({
                     context,
killedBy: Should get error response if invalid method is used
statusReason: Cannot read properties of undefined (reading 'errors')

[Killed] BlockStatement
src/server/GraphQLServer.ts:234:62
                 })
             }
 
-            if (response && isGraphQLServerRequest(request)) {
-                sendResponse({
-                    context,
-                    customHeaders: result.customHeaders,
-                    executionResult: result.executionResult,
-                    formatErrorFunction,
-                    logger,
-                    request,
-                    response,
-                    responseEndChunkFunction,
-                    responseFormat,
-                    responseStandardSchema,
-                    statusCode: result.statusCode,
-                })
-            }
+            if (response && isGraphQLServerRequest(request)) {}
             return result
         }
killedBy: Should get error response if invalid method is used
statusReason: Cannot read properties of undefined (reading 'errors')

[Killed] BlockStatement
src/server/GraphQLServer.ts:259:43
             isGraphQLServerRequest(request) ? request.method : undefined,
         )
 
-        if (adjustGraphQLExecutionResult) {
-            result = adjustGraphQLExecutionResult({
-                context,
-                executionResult: result,
-                formatErrorFunction,
-                logger,
-                request: isGraphQLServerRequest(request) ? request : undefined,
-            })
-        }
+        if (adjustGraphQLExecutionResult) {}
 
         if (response) {
killedBy: Should adjust execution result with data from mutation context info
statusReason: expected undefined to deeply equal { 'x-jwt': 'jwt-123456789' }

[Killed] ConditionalExpression
src/server/GraphQLServer.ts:259:13
             isGraphQLServerRequest(request) ? request.method : undefined,
         )
 
-        if (adjustGraphQLExecutionResult) {
+        if (true) {
             result = adjustGraphQLExecutionResult({
                 context,
killedBy: Should get correct metrics for SimpleMetricsClient
statusReason: adjustGraphQLExecutionResult is not a function

[Killed] ObjectLiteral
src/server/GraphQLServer.ts:260:51
         )
 
         if (adjustGraphQLExecutionResult) {
-            result = adjustGraphQLExecutionResult({
-                context,
-                executionResult: result,
-                formatErrorFunction,
-                logger,
-                request: isGraphQLServerRequest(request) ? request : undefined,
-            })
+            result = adjustGraphQLExecutionResult({})
         }
 
killedBy: Should adjust data response if adjustGraphQLExecutionResult is provided
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] ConditionalExpression
src/server/GraphQLServer.ts:269:13
             })
         }
 
-        if (response) {
+        if (true) {
             sendResponse({
                 context,
killedBy: Should get correct metrics for SimpleMetricsClient
statusReason: Cannot set properties of undefined (setting 'statusCode')

[Killed] ConditionalExpression
src/server/GraphQLServer.ts:269:13
             })
         }
 
-        if (response) {
+        if (false) {
             sendResponse({
                 context,
killedBy: Should receive correct error message if request validation fails
statusReason: expected 400 to be 200 // Object.is equality
