[Killed] BlockStatement
src/server/GraphQLServer.ts:321:53
         } = this.options
 
         // Reject requests if schema is invalid
-        if (!schema || !this.isValidSchema(schema)) {
-            metricsClient.setAvailability(0)
-            const error = getFirstErrorFromExecutionResult(
-                invalidSchemaResponse,
-            )
-            logger.error(
-                requestCouldNotBeProcessed,
-                context,
-                error,
-                INVALID_SCHEMA_ERROR,
-            )
-            collectErrorMetricsFunction({
-                context,
-                error,
-                errorName: INVALID_SCHEMA_ERROR,
-                serverOptions: this.options,
-            })
-            return { ...invalidSchemaResponse, ...requestInformation }
-        } else {
+        if (!schema || !this.isValidSchema(schema)) {} else {
             metricsClient.setAvailability(1)
         }
killedBy: Should get error response if invalid schema is used
statusReason: expected 'POST body contains invalid JSON.' to be 'Request cannot be processed. Schema i…' // Object.is equality

[Killed] ConditionalExpression
src/server/GraphQLServer.ts:321:13
         } = this.options
 
         // Reject requests if schema is invalid
-        if (!schema || !this.isValidSchema(schema)) {
+        if (false) {
             metricsClient.setAvailability(0)
             const error = getFirstErrorFromExecutionResult(
killedBy: Should get error response if invalid schema is used
statusReason: expected 'POST body contains invalid JSON.' to be 'Request cannot be processed. Schema i…' // Object.is equality

[Survived] BlockStatement
src/server/GraphQLServer.ts:339:16
                 serverOptions: this.options,
             })
             return { ...invalidSchemaResponse, ...requestInformation }
-        } else {
-            metricsClient.setAvailability(1)
-        }
+        } else {}
 
         if (!requestInformation.query && requestInformation.error) {

[Killed] BooleanLiteral
src/server/GraphQLServer.ts:343:13
             metricsClient.setAvailability(1)
         }
 
-        if (!requestInformation.query && requestInformation.error) {
+        if (requestInformation.query && requestInformation.error) {
             logger.error(
                 requestCouldNotBeProcessed,
killedBy: Should get error response if body contains invalid json
statusReason: expected 'Request cannot be processed. No query…' to be 'POST body contains invalid JSON.' // Object.is equality

[Killed] BlockStatement
src/server/GraphQLServer.ts:343:68
             metricsClient.setAvailability(1)
         }
 
-        if (!requestInformation.query && requestInformation.error) {
-            logger.error(
-                requestCouldNotBeProcessed,
-                context,
-                requestInformation.error.graphQLError,
-                GRAPHQL_ERROR,
-            )
-            collectErrorMetricsFunction({
-                context,
-                error: requestInformation.error,
-                errorName: GRAPHQL_ERROR,
-                serverOptions: this.options,
-            })
-            return {
-                executionResult: {
-                    errors: [requestInformation.error.graphQLError],
-                },
-                requestInformation: requestInformation,
-                statusCode: requestInformation.error.statusCode,
-            }
-        }
+        if (!requestInformation.query && requestInformation.error) {}
         // Reject request if no query parameter is provided
         else if (!requestInformation.query) {
killedBy: Should get error response if body contains invalid json
statusReason: error.toJSON is not a function

[Killed] ObjectLiteral
src/server/GraphQLServer.ts:350:41
                 requestInformation.error.graphQLError,
                 GRAPHQL_ERROR,
             )
-            collectErrorMetricsFunction({
-                context,
-                error: requestInformation.error,
-                errorName: GRAPHQL_ERROR,
-                serverOptions: this.options,
-            })
+            collectErrorMetricsFunction({})
             return {
                 executionResult: {
killedBy: Should get correct metrics for SimpleMetricsClient
statusReason: Cannot destructure property 'logger' of 'serverOptions' as it is undefined.

[Killed] ObjectLiteral
src/server/GraphQLServer.ts:356:20
                 errorName: GRAPHQL_ERROR,
                 serverOptions: this.options,
             })
-            return {
-                executionResult: {
-                    errors: [requestInformation.error.graphQLError],
-                },
-                requestInformation: requestInformation,
-                statusCode: requestInformation.error.statusCode,
-            }
+            return {}
         }
         // Reject request if no query parameter is provided
killedBy: Should get error response if body contains invalid json
statusReason: Cannot read properties of undefined (reading 'errors')

[Killed] ObjectLiteral
src/server/GraphQLServer.ts:357:34
                 serverOptions: this.options,
             })
             return {
-                executionResult: {
-                    errors: [requestInformation.error.graphQLError],
-                },
+                executionResult: {},
                 requestInformation: requestInformation,
                 statusCode: requestInformation.error.statusCode,
killedBy: Should get error response if body contains invalid json
statusReason: expected 'GraphQL response should contain at le…' to be 'POST body contains invalid JSON.' // Object.is equality

[Killed] BooleanLiteral
src/server/GraphQLServer.ts:365:18
             }
         }
         // Reject request if no query parameter is provided
-        else if (!requestInformation.query) {
+        else if (requestInformation.query) {
             const response = missingQueryParameterResponse(requestMethod)
             const error = getFirstErrorFromExecutionResult(response)
killedBy: Should get data response
statusReason: Cannot read properties of undefined (reading 'users')

[Killed] ConditionalExpression
src/server/GraphQLServer.ts:365:18
             }
         }
         // Reject request if no query parameter is provided
-        else if (!requestInformation.query) {
+        else if (false) {
             const response = missingQueryParameterResponse(requestMethod)
             const error = getFirstErrorFromExecutionResult(response)
killedBy: Should get error response if body does not contain query information
statusReason: error.toJSON is not a function

[Killed] BlockStatement
src/server/GraphQLServer.ts:385:13
 
         // Parse given GraphQL source into a document (parse(query) function)
         let documentAST: DocumentNode
-        try {
-            documentAST = parseFunction(
-                new Source(requestInformation.query, 'GraphQL request'),
-            )
-        } catch (syntaxError: unknown) {
+        try {} catch (syntaxError: unknown) {
             logger.error(
                 requestCouldNotBeProcessed,
killedBy: Should get correct metrics for SimpleMetricsClient
statusReason: Must provide document.

[Killed] BlockStatement
src/server/GraphQLServer.ts:389:40
             documentAST = parseFunction(
                 new Source(requestInformation.query, 'GraphQL request'),
             )
-        } catch (syntaxError: unknown) {
-            logger.error(
-                requestCouldNotBeProcessed,
-                context,
-                syntaxError as GraphQLError,
-                SYNTAX_ERROR,
-            )
-            collectErrorMetricsFunction({
-                context,
-                error: syntaxError,
-                errorName: SYNTAX_ERROR,
-                serverOptions: this.options,
-            })
-            return {
-                executionResult: { errors: [syntaxError as GraphQLError] },
-                requestInformation: requestInformation,
-                statusCode: responseFormat === 'GRAPHQL-RESPONSE' ? 400 : 200,
-            }
-        }
+        } catch (syntaxError: unknown) {}
         logger.debug(
             `Parsing query into document succeeded with document: ${JSON.stringify(documentAST)}`,
killedBy: Should get error response if query does not match expected query format
statusReason: Must provide document.

[Killed] ConditionalExpression
src/server/GraphQLServer.ts:405:29
             return {
                 executionResult: { errors: [syntaxError as GraphQLError] },
                 requestInformation: requestInformation,
-                statusCode: responseFormat === 'GRAPHQL-RESPONSE' ? 400 : 200,
+                statusCode: true ? 400 : 200,
             }
         }
killedBy: Should get error response if query does not match expected query format
statusReason: expected 400 to be 200 // Object.is equality

[Killed] EqualityOperator
src/server/GraphQLServer.ts:405:29
             return {
                 executionResult: { errors: [syntaxError as GraphQLError] },
                 requestInformation: requestInformation,
-                statusCode: responseFormat === 'GRAPHQL-RESPONSE' ? 400 : 200,
+                statusCode: responseFormat !== 'GRAPHQL-RESPONSE' ? 400 : 200,
             }
         }
killedBy: Should get error response if query does not match expected query format
statusReason: expected 400 to be 200 // Object.is equality

[Killed] EqualityOperator
src/server/GraphQLServer.ts:424:13
             validationOptions,
             validationTypeInfo,
         )
-        if (validationErrors.length > 0) {
+        if (validationErrors.length <= 0) {
             logger.debug(
                 `One or more validation errors occurred: ${JSON.stringify(validationErrors)}`,
killedBy: Should get data response
statusReason: Cannot read properties of undefined (reading 'users')

[Killed] ConditionalExpression
src/server/GraphQLServer.ts:424:13
             validationOptions,
             validationTypeInfo,
         )
-        if (validationErrors.length > 0) {
+        if (true) {
             logger.debug(
                 `One or more validation errors occurred: ${JSON.stringify(validationErrors)}`,
killedBy: Should get correct metrics for SimpleMetricsClient
statusReason: expected '\n            # HELP graphql_server_r…' to contain 'graphql_server_errors{errorClass="Gra…'

[Killed] BlockStatement
src/server/GraphQLServer.ts:429:61
                 `One or more validation errors occurred: ${JSON.stringify(validationErrors)}`,
                 context,
             )
-            for (const validationError of validationErrors) {
-                const errorName =
-                    determineValidationOrIntrospectionDisabledError(
-                        validationError,
-                    )
-                logger.error(
-                    validationErrorMessage,
-                    context,
-                    validationError,
-                    errorName,
-                )
-                collectErrorMetricsFunction({
-                    context,
-                    error: validationError,
-                    errorName,
-                    serverOptions: this.options,
-                })
-            }
+            for (const validationError of validationErrors) {}
             return {
                 executionResult: {
killedBy: Should receive correct error message if request validation fails
statusReason: expected undefined to be 'ValidationError: Cannot query field "…' // Object.is equality

[Killed] ObjectLiteral
src/server/GraphQLServer.ts:447:20
                     serverOptions: this.options,
                 })
             }
-            return {
-                executionResult: {
-                    errors: removeValidationRecommendations
-                        ? removeValidationRecommendationsFromErrors(
-                              validationErrors,
-                          )
-                        : validationErrors,
-                },
-                requestInformation: requestInformation,
-                statusCode: responseFormat === 'GRAPHQL-RESPONSE' ? 400 : 200,
-            }
+            return {}
         }
 
killedBy: Should get filtered error response if a validation error occurs
statusReason: Cannot read properties of undefined (reading 'errors')

[Killed] ObjectLiteral
src/server/GraphQLServer.ts:448:34
                 })
             }
             return {
-                executionResult: {
-                    errors: removeValidationRecommendations
-                        ? removeValidationRecommendationsFromErrors(
-                              validationErrors,
-                          )
-                        : validationErrors,
-                },
+                executionResult: {},
                 requestInformation: requestInformation,
                 statusCode: responseFormat === 'GRAPHQL-RESPONSE' ? 400 : 200,
killedBy: Should get filtered error response if a validation error occurs
statusReason: expected 'GraphQL response should contain at le…' to be 'Cannot query field "userIdABC" on typ…' // Object.is equality

[Killed] ConditionalExpression
src/server/GraphQLServer.ts:456:29
                         : validationErrors,
                 },
                 requestInformation: requestInformation,
-                statusCode: responseFormat === 'GRAPHQL-RESPONSE' ? 400 : 200,
+                statusCode: false ? 400 : 200,
             }
         }
killedBy: Should correctly handle requests when returnNotAcceptableForUnsupportedResponseFormat is true
statusReason: expected 200 to be 400 // Object.is equality

[Killed] LogicalOperator
src/server/GraphQLServer.ts:470:13
             requestInformation.operationName,
         )
         if (
-            requestMethod === 'GET' &&
-            operationAST &&
-            operationAST.operation !== 'query'
+            requestMethod === 'GET' && operationAST || operationAST.operation !== 'query'
         ) {
             const response = onlyQueryInGetRequestsResponse(
killedBy: Should get data response when using a mutation
statusReason: Cannot read properties of undefined (reading 'logout')

[Killed] ConditionalExpression
src/server/GraphQLServer.ts:470:13
             requestInformation.operationName,
         )
         if (
-            requestMethod === 'GET' &&
-            operationAST &&
-            operationAST.operation !== 'query'
+            false
         ) {
             const response = onlyQueryInGetRequestsResponse(
killedBy: Should get error response when using mutation in a GET request
statusReason: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
src/server/GraphQLServer.ts:472:13
         if (
             requestMethod === 'GET' &&
             operationAST &&
-            operationAST.operation !== 'query'
+            true
         ) {
             const response = onlyQueryInGetRequestsResponse(
killedBy: Should get data response when using GET request
statusReason: Cannot read properties of undefined (reading 'users')

[Killed] EqualityOperator
src/server/GraphQLServer.ts:472:13
         if (
             requestMethod === 'GET' &&
             operationAST &&
-            operationAST.operation !== 'query'
+            operationAST.operation === 'query'
         ) {
             const response = onlyQueryInGetRequestsResponse(
killedBy: Should get data response when using GET request
statusReason: Cannot read properties of undefined (reading 'users')

[Killed] BlockStatement
src/server/GraphQLServer.ts:473:11
             requestMethod === 'GET' &&
             operationAST &&
             operationAST.operation !== 'query'
-        ) {
-            const response = onlyQueryInGetRequestsResponse(
-                operationAST.operation,
-            )
-            const error = getFirstErrorFromExecutionResult(response)
-            logger.error(
-                requestCouldNotBeProcessed,
-                context,
-                error,
-                METHOD_NOT_ALLOWED_ERROR,
-            )
-            collectErrorMetricsFunction({
-                context,
-                error,
-                errorName: METHOD_NOT_ALLOWED_ERROR,
-                serverOptions: this.options,
-            })
-            return { ...response, ...requestInformation }
-        }
+        ) {}
 
         /**
killedBy: Should get error response when using mutation in a GET request
statusReason: Cannot read properties of undefined (reading '0')

[Killed] ObjectLiteral
src/server/GraphQLServer.ts:484:41
                 error,
                 METHOD_NOT_ALLOWED_ERROR,
             )
-            collectErrorMetricsFunction({
-                context,
-                error,
-                errorName: METHOD_NOT_ALLOWED_ERROR,
-                serverOptions: this.options,
-            })
+            collectErrorMetricsFunction({})
             return { ...response, ...requestInformation }
         }
killedBy: Should get error response when using mutation in a GET request
statusReason: Cannot destructure property 'logger' of 'serverOptions' as it is undefined.

[Killed] ObjectLiteral
src/server/GraphQLServer.ts:490:20
                 errorName: METHOD_NOT_ALLOWED_ERROR,
                 serverOptions: this.options,
             })
-            return { ...response, ...requestInformation }
+            return {}
         }
 
killedBy: Should get error response when using mutation in a GET request
statusReason: Cannot read properties of undefined (reading 'errors')

[Killed] ObjectLiteral
src/server/GraphQLServer.ts:510:56
                 variableValues: requestInformation.variables,
             })
 
-            const extensionsResult = extensionFunction({
-                context,
-                executionResult,
-                requestInformation,
-                serverOptions: this.options,
-            })
+            const extensionsResult = extensionFunction({})
             if (extensionsResult) {
                 executionResult.extensions = extensionsResult
killedBy: Should get data response
statusReason: error.toJSON is not a function

[Killed] ConditionalExpression
src/server/GraphQLServer.ts:516:17
                 requestInformation,
                 serverOptions: this.options,
             })
-            if (extensionsResult) {
+            if (false) {
                 executionResult.extensions = extensionsResult
             }
killedBy: Should get extensions in GraphQL response if extension function is defined
statusReason: expected undefined to strictly equal { hello: 'world' }

[Killed] BlockStatement
src/server/GraphQLServer.ts:516:35
                 requestInformation,
                 serverOptions: this.options,
             })
-            if (extensionsResult) {
-                executionResult.extensions = extensionsResult
-            }
+            if (extensionsResult) {}
 
             // Collect error metrics for execution result
killedBy: Should get extensions in GraphQL response if extension function is defined
statusReason: expected undefined to strictly equal { hello: 'world' }

[Killed] EqualityOperator
src/server/GraphQLServer.ts:521:43
             }
 
             // Collect error metrics for execution result
-            if (executionResult.errors && executionResult.errors.length > 0) {
+            if (executionResult.errors && executionResult.errors.length <= 0) {
                 for (const error of executionResult.errors) {
                     if (
killedBy: Should get custom fetch error message in response when using GraphQLRequestInfo
statusReason: expected 'Request failed ETIMEDOUT connection f…' to be 'network.error' // Object.is equality

[Killed] ConditionalExpression
src/server/GraphQLServer.ts:521:17
             }
 
             // Collect error metrics for execution result
-            if (executionResult.errors && executionResult.errors.length > 0) {
+            if (false) {
                 for (const error of executionResult.errors) {
                     if (
killedBy: Should receive correct error message if response contains a GraphQLError
statusReason: expected undefined to be 'Error: Something went wrong!' // Object.is equality

[Killed] LogicalOperator
src/server/GraphQLServer.ts:524:25
             if (executionResult.errors && executionResult.errors.length > 0) {
                 for (const error of executionResult.errors) {
                     if (
-                        reassignAggregateError &&
-                        error.originalError &&
+                        reassignAggregateError || error.originalError &&
                         isAggregateError(error.originalError)
                     ) {
killedBy: Should not reassign AggregateError to original errors field when reassignAggregateError is disabled
statusReason: expected 'The first error!' to be 'The first error!, The second error!' // Object.is equality

[Killed] ConditionalExpression
src/server/GraphQLServer.ts:524:25
             if (executionResult.errors && executionResult.errors.length > 0) {
                 for (const error of executionResult.errors) {
                     if (
-                        reassignAggregateError &&
-                        error.originalError &&
-                        isAggregateError(error.originalError)
+                        true
                     ) {
                         logger.debug(
killedBy: Should get custom fetch error message in response when using GraphQLRequestInfo
statusReason: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
src/server/GraphQLServer.ts:527:23
                         reassignAggregateError &&
                         error.originalError &&
                         isAggregateError(error.originalError)
-                    ) {
-                        logger.debug(
-                            'Error is AggregateError and reassignAggregateError feature is enabled. AggregateError will be reassigned to original errors field.',
-                            context,
-                        )
-                        executionResult.errors = error.originalError.errors
-                    }
+                    ) {}
 
                     const graphqlOrFetchError =
killedBy: Should reassign AggregateError to original errors field when reassignAggregateError is enabled
statusReason: expected 'The first error!, The second error!' to be 'The first error!' // Object.is equality

[Killed] ConditionalExpression
src/server/GraphQLServer.ts:538:25
                     const graphqlOrFetchError =
                         determineGraphQLOrFetchError(error)
                     if (
-                        graphqlOrFetchError === FETCH_ERROR &&
-                        fetchErrorMessage !== undefined
+                        false
                     ) {
                         error.message = fetchErrorMessage
killedBy: Should get custom fetch error message in response when using GraphQLRequestInfo
statusReason: expected 'Request failed ETIMEDOUT connection f…' to be 'network.error' // Object.is equality

[Killed] LogicalOperator
src/server/GraphQLServer.ts:538:25
                     const graphqlOrFetchError =
                         determineGraphQLOrFetchError(error)
                     if (
-                        graphqlOrFetchError === FETCH_ERROR &&
-                        fetchErrorMessage !== undefined
+                        graphqlOrFetchError === FETCH_ERROR || fetchErrorMessage !== undefined
                     ) {
                         error.message = fetchErrorMessage
killedBy: Should get error response if resolver returns GraphQL error
statusReason: expected 'network.error' to be 'Something went wrong!' // Object.is equality

[Killed] EqualityOperator
src/server/GraphQLServer.ts:539:25
                         determineGraphQLOrFetchError(error)
                     if (
                         graphqlOrFetchError === FETCH_ERROR &&
-                        fetchErrorMessage !== undefined
+                        fetchErrorMessage === undefined
                     ) {
                         error.message = fetchErrorMessage
killedBy: Should get custom fetch error message in response when using GraphQLRequestInfo
statusReason: expected 'Request failed ETIMEDOUT connection f…' to be 'network.error' // Object.is equality

[Survived] ConditionalExpression
src/server/GraphQLServer.ts:539:25
                         determineGraphQLOrFetchError(error)
                     if (
                         graphqlOrFetchError === FETCH_ERROR &&
-                        fetchErrorMessage !== undefined
+                        true
                     ) {
                         error.message = fetchErrorMessage

[Killed] BlockStatement
src/server/GraphQLServer.ts:540:23
                     if (
                         graphqlOrFetchError === FETCH_ERROR &&
                         fetchErrorMessage !== undefined
-                    ) {
-                        error.message = fetchErrorMessage
-                    }
+                    ) {}
 
                     logger.error(
killedBy: Should get custom fetch error message in response when using GraphQLRequestInfo
statusReason: expected 'Request failed ETIMEDOUT connection f…' to be 'network.error' // Object.is equality

[Killed] BlockStatement
src/server/GraphQLServer.ts:568:34
                 requestInformation: requestInformation,
                 statusCode: 200,
             }
-        } catch (error: unknown) {
-            logger.error(
-                graphqlExecutionErrorMessage,
-                context,
-                error as GraphQLError,
-                determineGraphQLOrFetchError(error),
-            )
-            increaseFetchOrGraphQLErrorMetric(error, this.options, context)
-            return {
-                executionResult: { errors: [error as GraphQLError] },
-                requestInformation: requestInformation,
-                statusCode: 400,
-            }
-        }
+        } catch (error: unknown) {}
     }
 }
killedBy: Should get error response when GraphQL context error occurs when calling execute function
statusReason: Cannot read properties of undefined (reading 'customHeaders')
