[Killed] BlockStatement
src/validation/GetResponseSchemaValidationErrors.ts:12:50
 export function getResponseSchemaValidationErrors<T extends StandardSchemaV1>(
     schema: T,
     input: StandardSchemaV1.InferInput<T>,
-): readonly StandardSchemaV1.Issue[] | undefined {
-    let result = schema['~standard'].validate(input)
-    if (result instanceof Promise) {
-        throw new TypeError('Validation function must be synchronous')
-    } else {
-        return result.issues
-    }
-}
+): readonly StandardSchemaV1.Issue[] | undefined {}
 
killedBy: Should log errors if ServerResponse or StandardSchema have no correct implementation
statusReason: expected 'Cannot set content-type header becaus…' to be 'An error occurred while validating th…' // Object.is equality

[Killed] ConditionalExpression
src/validation/GetResponseSchemaValidationErrors.ts:14:9
     input: StandardSchemaV1.InferInput<T>,
 ): readonly StandardSchemaV1.Issue[] | undefined {
     let result = schema['~standard'].validate(input)
-    if (result instanceof Promise) {
+    if (true) {
         throw new TypeError('Validation function must be synchronous')
     } else {
killedBy: Should send response validation error if any exist
statusReason: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
src/validation/GetResponseSchemaValidationErrors.ts:14:36
     input: StandardSchemaV1.InferInput<T>,
 ): readonly StandardSchemaV1.Issue[] | undefined {
     let result = schema['~standard'].validate(input)
-    if (result instanceof Promise) {
-        throw new TypeError('Validation function must be synchronous')
-    } else {
+    if (result instanceof Promise) {} else {
         return result.issues
     }
killedBy: Should throw a TypeError if schema returns a Promise
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/validation/GetResponseSchemaValidationErrors.ts:15:29
 ): readonly StandardSchemaV1.Issue[] | undefined {
     let result = schema['~standard'].validate(input)
     if (result instanceof Promise) {
-        throw new TypeError('Validation function must be synchronous')
+        throw new TypeError("")
     } else {
         return result.issues
killedBy: Should throw a TypeError if schema returns a Promise
statusReason: expected [Function] to throw error including 'Validation function must be synchrono…' but got ''

[Killed] BlockStatement
src/validation/GetResponseSchemaValidationErrors.ts:16:12
     let result = schema['~standard'].validate(input)
     if (result instanceof Promise) {
         throw new TypeError('Validation function must be synchronous')
-    } else {
-        return result.issues
-    }
+    } else {}
 }
 
killedBy: Should send response validation error if any exist
statusReason: Cannot read properties of undefined (reading '0')
